
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#अन्तर्भाव <ngx_config.h>
#अन्तर्भाव <ngx_core.h>


स्थिर ngx_radix_ग्रन्थिः_t *ngx_radix_alloc(ngx_radix_वृक्षः_t *वृक्षः);


ngx_radix_वृक्षः_t *
ngx_radix_वृक्षः_create(ngx_pool_t *pool, ngx_int_t preallocate)
{
    uint32_t           कुञ्चिका, आवरणम्, inc;
    ngx_radix_वृक्षः_t  *वृक्षः;

    वृक्षः = ngx_palloc(pool, परिमाण(ngx_radix_वृक्षः_t));
    यदि (वृक्षः == रिक्त) {
        प्रत्यागम रिक्त;
    }

    वृक्षः->pool = pool;
    वृक्षः->मुक्त = रिक्त;
    वृक्षः->start = रिक्त;
    वृक्षः->आकार = 0;

    वृक्षः->मूलम् = ngx_radix_alloc(वृक्षः);
    यदि (वृक्षः->मूलम् == रिक्त) {
        प्रत्यागम रिक्त;
    }

    वृक्षः->मूलम्->दक्षिणः = रिक्त;
    वृक्षः->मूलम्->वामः = रिक्त;
    वृक्षः->मूलम्->parent = रिक्त;
    वृक्षः->मूलम्->मानम् = NGX_RADIX_NO_मानम्;

    यदि (preallocate == 0) {
        प्रत्यागम वृक्षः;
    }

    /*
     * Preallocation of first nodes : 0, 1, 00, 01, 10, 11, 000, 001, etc.
     * increases TLB hits even if for first lookup iterations.
     * On 32-bit platforms the 7 preallocated bits takes continuous 4K,
     * 8 - 8K, 9 - 16K, etc.  On 64-bit platforms the 6 preallocated bits
     * takes continuous 4K, 7 - 8K, 8 - 16K, etc.  There is no sense to
     * to preallocate more than one page, because further preallocation
     * distributes the only bit per page.  Instead, a random insertion
     * may distribute several bits per page.
     *
     * Thus, by default we preallocate maximum
     *     6 bits on amd64 (64-bit platform and 4K pages)
     *     7 bits on i386 (32-bit platform and 4K pages)
     *     7 bits on sparc64 in 64-bit mode (8K pages)
     *     8 bits on sparc64 in 32-bit mode (8K pages)
     */

    यदि (preallocate == -1) {
        विकल्प (ngx_pagesize / परिमाण(ngx_radix_ग्रन्थिः_t)) {

        /* amd64 */
        पक्ष 128:
            preallocate = 6;
            भङ्ग;

        /* i386, sparc64 */
        पक्ष 256:
            preallocate = 7;
            भङ्ग;

        /* sparc64 in 32-bit mode */
        स्वभाव:
            preallocate = 8;
        }
    }

    आवरणम् = 0;
    inc = 0x80000000;

    यावत् (preallocate--) {

        कुञ्चिका = 0;
        आवरणम् >>= 1;
        आवरणम् |= 0x80000000;

        कुरु {
            यदि (ngx_radix32tree_निवेशय(वृक्षः, कुञ्चिका, आवरणम्, NGX_RADIX_NO_मानम्)
                != NGX_OK)
            {
                प्रत्यागम रिक्त;
            }

            कुञ्चिका += inc;

        } यावत् (कुञ्चिका);

        inc >>= 1;
    }

    प्रत्यागम वृक्षः;
}


ngx_int_t
ngx_radix32tree_निवेशय(ngx_radix_वृक्षः_t *वृक्षः, uint32_t कुञ्चिका, uint32_t आवरणम्,
    uintptr_t मानम्)
{
    uint32_t           bit;
    ngx_radix_ग्रन्थिः_t  *ग्रन्थिः, *अग्र;

    bit = 0x80000000;

    ग्रन्थिः = वृक्षः->मूलम्;
    अग्र = वृक्षः->मूलम्;

    यावत् (bit & आवरणम्) {
        यदि (कुञ्चिका & bit) {
            अग्र = ग्रन्थिः->दक्षिणः;

        } अन्यथा {
            अग्र = ग्रन्थिः->वामः;
        }

        यदि (अग्र == रिक्त) {
            भङ्ग;
        }

        bit >>= 1;
        ग्रन्थिः = अग्र;
    }

    यदि (अग्र) {
        यदि (ग्रन्थिः->मानम् != NGX_RADIX_NO_मानम्) {
            प्रत्यागम NGX_BUSY;
        }

        ग्रन्थिः->मानम् = मानम्;
        प्रत्यागम NGX_OK;
    }

    यावत् (bit & आवरणम्) {
        अग्र = ngx_radix_alloc(वृक्षः);
        यदि (अग्र == रिक्त) {
            प्रत्यागम NGX_ERROR;
        }

        अग्र->दक्षिणः = रिक्त;
        अग्र->वामः = रिक्त;
        अग्र->parent = ग्रन्थिः;
        अग्र->मानम् = NGX_RADIX_NO_मानम्;

        यदि (कुञ्चिका & bit) {
            ग्रन्थिः->दक्षिणः = अग्र;

        } अन्यथा {
            ग्रन्थिः->वामः = अग्र;
        }

        bit >>= 1;
        ग्रन्थिः = अग्र;
    }

    ग्रन्थिः->मानम् = मानम्;

    प्रत्यागम NGX_OK;
}


ngx_int_t
ngx_radix32tree_delete(ngx_radix_वृक्षः_t *वृक्षः, uint32_t कुञ्चिका, uint32_t आवरणम्)
{
    uint32_t           bit;
    ngx_radix_ग्रन्थिः_t  *ग्रन्थिः;

    bit = 0x80000000;
    ग्रन्थिः = वृक्षः->मूलम्;

    यावत् (ग्रन्थिः && (bit & आवरणम्)) {
        यदि (कुञ्चिका & bit) {
            ग्रन्थिः = ग्रन्थिः->दक्षिणः;

        } अन्यथा {
            ग्रन्थिः = ग्रन्थिः->वामः;
        }

        bit >>= 1;
    }

    यदि (ग्रन्थिः == रिक्त) {
        प्रत्यागम NGX_ERROR;
    }

    यदि (ग्रन्थिः->दक्षिणः || ग्रन्थिः->वामः) {
        यदि (ग्रन्थिः->मानम् != NGX_RADIX_NO_मानम्) {
            ग्रन्थिः->मानम् = NGX_RADIX_NO_मानम्;
            प्रत्यागम NGX_OK;
        }

        प्रत्यागम NGX_ERROR;
    }

    प्रति ( ;; ) {
        यदि (ग्रन्थिः->parent->दक्षिणः == ग्रन्थिः) {
            ग्रन्थिः->parent->दक्षिणः = रिक्त;

        } अन्यथा {
            ग्रन्थिः->parent->वामः = रिक्त;
        }

        ग्रन्थिः->दक्षिणः = वृक्षः->मुक्त;
        वृक्षः->मुक्त = ग्रन्थिः;

        ग्रन्थिः = ग्रन्थिः->parent;

        यदि (ग्रन्थिः->दक्षिणः || ग्रन्थिः->वामः) {
            भङ्ग;
        }

        यदि (ग्रन्थिः->मानम् != NGX_RADIX_NO_मानम्) {
            भङ्ग;
        }

        यदि (ग्रन्थिः->parent == रिक्त) {
            भङ्ग;
        }
    }

    प्रत्यागम NGX_OK;
}


uintptr_t
ngx_radix32tree_find(ngx_radix_वृक्षः_t *वृक्षः, uint32_t कुञ्चिका)
{
    uint32_t           bit;
    uintptr_t          मानम्;
    ngx_radix_ग्रन्थिः_t  *ग्रन्थिः;

    bit = 0x80000000;
    मानम् = NGX_RADIX_NO_मानम्;
    ग्रन्थिः = वृक्षः->मूलम्;

    यावत् (ग्रन्थिः) {
        यदि (ग्रन्थिः->मानम् != NGX_RADIX_NO_मानम्) {
            मानम् = ग्रन्थिः->मानम्;
        }

        यदि (कुञ्चिका & bit) {
            ग्रन्थिः = ग्रन्थिः->दक्षिणः;

        } अन्यथा {
            ग्रन्थिः = ग्रन्थिः->वामः;
        }

        bit >>= 1;
    }

    प्रत्यागम मानम्;
}


#यदि (NGX_HAVE_INET6)

ngx_int_t
ngx_radix128tree_निवेशय(ngx_radix_वृक्षः_t *वृक्षः, u_char *कुञ्चिका, u_char *आवरणम्,
    uintptr_t मानम्)
{
    u_char             bit;
    ngx_uint_t         i;
    ngx_radix_ग्रन्थिः_t  *ग्रन्थिः, *अग्र;

    i = 0;
    bit = 0x80;

    ग्रन्थिः = वृक्षः->मूलम्;
    अग्र = वृक्षः->मूलम्;

    यावत् (bit & आवरणम्[i]) {
        यदि (कुञ्चिका[i] & bit) {
            अग्र = ग्रन्थिः->दक्षिणः;

        } अन्यथा {
            अग्र = ग्रन्थिः->वामः;
        }

        यदि (अग्र == रिक्त) {
            भङ्ग;
        }

        bit >>= 1;
        ग्रन्थिः = अग्र;

        यदि (bit == 0) {
            यदि (++i == 16) {
                भङ्ग;
            }

            bit = 0x80;
        }
    }

    यदि (अग्र) {
        यदि (ग्रन्थिः->मानम् != NGX_RADIX_NO_मानम्) {
            प्रत्यागम NGX_BUSY;
        }

        ग्रन्थिः->मानम् = मानम्;
        प्रत्यागम NGX_OK;
    }

    यावत् (bit & आवरणम्[i]) {
        अग्र = ngx_radix_alloc(वृक्षः);
        यदि (अग्र == रिक्त) {
            प्रत्यागम NGX_ERROR;
        }

        अग्र->दक्षिणः = रिक्त;
        अग्र->वामः = रिक्त;
        अग्र->parent = ग्रन्थिः;
        अग्र->मानम् = NGX_RADIX_NO_मानम्;

        यदि (कुञ्चिका[i] & bit) {
            ग्रन्थिः->दक्षिणः = अग्र;

        } अन्यथा {
            ग्रन्थिः->वामः = अग्र;
        }

        bit >>= 1;
        ग्रन्थिः = अग्र;

        यदि (bit == 0) {
            यदि (++i == 16) {
                भङ्ग;
            }

            bit = 0x80;
        }
    }

    ग्रन्थिः->मानम् = मानम्;

    प्रत्यागम NGX_OK;
}


ngx_int_t
ngx_radix128tree_delete(ngx_radix_वृक्षः_t *वृक्षः, u_char *कुञ्चिका, u_char *आवरणम्)
{
    u_char             bit;
    ngx_uint_t         i;
    ngx_radix_ग्रन्थिः_t  *ग्रन्थिः;

    i = 0;
    bit = 0x80;
    ग्रन्थिः = वृक्षः->मूलम्;

    यावत् (ग्रन्थिः && (bit & आवरणम्[i])) {
        यदि (कुञ्चिका[i] & bit) {
            ग्रन्थिः = ग्रन्थिः->दक्षिणः;

        } अन्यथा {
            ग्रन्थिः = ग्रन्थिः->वामः;
        }

        bit >>= 1;

        यदि (bit == 0) {
            यदि (++i == 16) {
                भङ्ग;
            }

            bit = 0x80;
        }
    }

    यदि (ग्रन्थिः == रिक्त) {
        प्रत्यागम NGX_ERROR;
    }

    यदि (ग्रन्थिः->दक्षिणः || ग्रन्थिः->वामः) {
        यदि (ग्रन्थिः->मानम् != NGX_RADIX_NO_मानम्) {
            ग्रन्थिः->मानम् = NGX_RADIX_NO_मानम्;
            प्रत्यागम NGX_OK;
        }

        प्रत्यागम NGX_ERROR;
    }

    प्रति ( ;; ) {
        यदि (ग्रन्थिः->parent->दक्षिणः == ग्रन्थिः) {
            ग्रन्थिः->parent->दक्षिणः = रिक्त;

        } अन्यथा {
            ग्रन्थिः->parent->वामः = रिक्त;
        }

        ग्रन्थिः->दक्षिणः = वृक्षः->मुक्त;
        वृक्षः->मुक्त = ग्रन्थिः;

        ग्रन्थिः = ग्रन्थिः->parent;

        यदि (ग्रन्थिः->दक्षिणः || ग्रन्थिः->वामः) {
            भङ्ग;
        }

        यदि (ग्रन्थिः->मानम् != NGX_RADIX_NO_मानम्) {
            भङ्ग;
        }

        यदि (ग्रन्थिः->parent == रिक्त) {
            भङ्ग;
        }
    }

    प्रत्यागम NGX_OK;
}


uintptr_t
ngx_radix128tree_find(ngx_radix_वृक्षः_t *वृक्षः, u_char *कुञ्चिका)
{
    u_char             bit;
    uintptr_t          मानम्;
    ngx_uint_t         i;
    ngx_radix_ग्रन्थिः_t  *ग्रन्थिः;

    i = 0;
    bit = 0x80;
    मानम् = NGX_RADIX_NO_मानम्;
    ग्रन्थिः = वृक्षः->मूलम्;

    यावत् (ग्रन्थिः) {
        यदि (ग्रन्थिः->मानम् != NGX_RADIX_NO_मानम्) {
            मानम् = ग्रन्थिः->मानम्;
        }

        यदि (कुञ्चिका[i] & bit) {
            ग्रन्थिः = ग्रन्थिः->दक्षिणः;

        } अन्यथा {
            ग्रन्थिः = ग्रन्थिः->वामः;
        }

        bit >>= 1;

        यदि (bit == 0) {
            i++;
            bit = 0x80;
        }
    }

    प्रत्यागम मानम्;
}

#यदि_अन्तः


स्थिर ngx_radix_ग्रन्थिः_t *
ngx_radix_alloc(ngx_radix_वृक्षः_t *वृक्षः)
{
    ngx_radix_ग्रन्थिः_t  *p;

    यदि (वृक्षः->मुक्त) {
        p = वृक्षः->मुक्त;
        वृक्षः->मुक्त = वृक्षः->मुक्त->दक्षिणः;
        प्रत्यागम p;
    }

    यदि (वृक्षः->आकार < परिमाण(ngx_radix_ग्रन्थिः_t)) {
        वृक्षः->start = ngx_pmemalign(वृक्षः->pool, ngx_pagesize, ngx_pagesize);
        यदि (वृक्षः->start == रिक्त) {
            प्रत्यागम रिक्त;
        }

        वृक्षः->आकार = ngx_pagesize;
    }

    p = (ngx_radix_ग्रन्थिः_t *) वृक्षः->start;
    वृक्षः->start += परिमाण(ngx_radix_ग्रन्थिः_t);
    वृक्षः->आकार -= परिमाण(ngx_radix_ग्रन्थिः_t);

    प्रत्यागम p;
}
