
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#అన్తర్భావ <ngx_config.h>
#అన్తర్భావ <ngx_core.h>


స్థిర శూన్య ngx_వరుస_విలీనం(ngx_వరుస_t *వరుస, ngx_వరుస_t *తోక,
    ngx_int_t (*cmp)(స్థిరరాశి ngx_వరుస_t *, స్థిరరాశి ngx_వరుస_t *));


/*
 * find the middle queue element if the queue has odd number of elements
 * or the first element of the queue's second part otherwise
 */

ngx_వరుస_t *
ngx_వరుస_మధ్య(ngx_వరుస_t *వరుస)
{
    ngx_వరుస_t  *మధ్య, *తదుపరి;

    మధ్య = ngx_వరుస_తల(వరుస);

    ఒకవేళ (మధ్య == ngx_వరుస_చివరి(వరుస)) {
        తిరిగి మధ్య;
    }

    తదుపరి = ngx_వరుస_తల(వరుస);

    కొరకు ( ;; ) {
        మధ్య = ngx_వరుస_తదుపరి(మధ్య);

        తదుపరి = ngx_వరుస_తదుపరి(తదుపరి);

        ఒకవేళ (తదుపరి == ngx_వరుస_చివరి(వరుస)) {
            తిరిగి మధ్య;
        }

        తదుపరి = ngx_వరుస_తదుపరి(తదుపరి);

        ఒకవేళ (తదుపరి == ngx_వరుస_చివరి(వరుస)) {
            తిరిగి మధ్య;
        }
    }
}


/* the stable merge sort */

శూన్య
ngx_వరుస_క్రమీకరించు(ngx_వరుస_t *వరుస,
    ngx_int_t (*cmp)(స్థిరరాశి ngx_వరుస_t *, స్థిరరాశి ngx_వరుస_t *))
{
    ngx_వరుస_t  *q, తోక;

    q = ngx_వరుస_తల(వరుస);

    ఒకవేళ (q == ngx_వరుస_చివరి(వరుస)) {
        తిరిగి;
    }

    q = ngx_వరుస_మధ్య(వరుస);

    ngx_వరుస_విభజించు(వరుస, q, &తోక);

    ngx_వరుస_క్రమీకరించు(వరుస, cmp);
    ngx_వరుస_క్రమీకరించు(&తోక, cmp);

    ngx_వరుస_విలీనం(వరుస, &తోక, cmp);
}


స్థిర శూన్య
ngx_వరుస_విలీనం(ngx_వరుస_t *వరుస, ngx_వరుస_t *తోక,
    ngx_int_t (*cmp)(స్థిరరాశి ngx_వరుస_t *, స్థిరరాశి ngx_వరుస_t *))
{
    ngx_వరుస_t  *q1, *q2;

    q1 = ngx_వరుస_తల(వరుస);
    q2 = ngx_వరుస_తల(తోక);

    కొరకు ( ;; ) {
        ఒకవేళ (q1 == ngx_వరుస_sentinel(వరుస)) {
            ngx_వరుస_కూడు(వరుస, తోక);
            ఆపు;
        }

        ఒకవేళ (q2 == ngx_వరుస_sentinel(తోక)) {
            ఆపు;
        }

        ఒకవేళ (cmp(q1, q2) <= 0) {
            q1 = ngx_వరుస_తదుపరి(q1);
            కొనసాగు;
        }

        ngx_వరుస_remove(q2);
        ngx_వరుస_చొప్పించు_before(q1, q2);

        q2 = ngx_వరుస_తల(తోక);
    }
}
