
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#అన్తర్భావ <ngx_config.h>
#అన్తర్భావ <ngx_core.h>


స్థిర ngx_radix_కణుపు_t *ngx_radix_alloc(ngx_radix_వృక్షం_t *వృక్షం);


ngx_radix_వృక్షం_t *
ngx_radix_వృక్షం_create(ngx_pool_t *pool, ngx_int_t preallocate)
{
    uint32_t           కీలకం, ముసుగు, inc;
    ngx_radix_వృక్షం_t  *వృక్షం;

    వృక్షం = ngx_palloc(pool, పరిమాణం(ngx_radix_వృక్షం_t));
    ఒకవేళ (వృక్షం == ఖాళీ) {
        తిరిగి ఖాళీ;
    }

    వృక్షం->pool = pool;
    వృక్షం->విడుదల = ఖాళీ;
    వృక్షం->ప్రారంభం = ఖాళీ;
    వృక్షం->కొలత = 0;

    వృక్షం->మూలం = ngx_radix_alloc(వృక్షం);
    ఒకవేళ (వృక్షం->మూలం == ఖాళీ) {
        తిరిగి ఖాళీ;
    }

    వృక్షం->మూలం->కుడి = ఖాళీ;
    వృక్షం->మూలం->ఎడమ = ఖాళీ;
    వృక్షం->మూలం->మాతృ = ఖాళీ;
    వృక్షం->మూలం->విలువ = NGX_RADIX_NO_విలువ;

    ఒకవేళ (preallocate == 0) {
        తిరిగి వృక్షం;
    }

    /*
     * Preallocation of first nodes : 0, 1, 00, 01, 10, 11, 000, 001, etc.
     * increases TLB hits even if for first lookup iterations.
     * On 32-bit platforms the 7 preallocated bits takes continuous 4K,
     * 8 - 8K, 9 - 16K, etc.  On 64-bit platforms the 6 preallocated bits
     * takes continuous 4K, 7 - 8K, 8 - 16K, etc.  There is no sense to
     * to preallocate more than one page, because further preallocation
     * distributes the only bit per page.  Instead, a random insertion
     * may distribute several bits per page.
     *
     * Thus, by default we preallocate maximum
     *     6 bits on amd64 (64-bit platform and 4K pages)
     *     7 bits on i386 (32-bit platform and 4K pages)
     *     7 bits on sparc64 in 64-bit mode (8K pages)
     *     8 bits on sparc64 in 32-bit mode (8K pages)
     */

    ఒకవేళ (preallocate == -1) {
        ఎంపిక (ngx_pagesize / పరిమాణం(ngx_radix_కణుపు_t)) {

        /* amd64 */
        స్థితి 128:
            preallocate = 6;
            ఆపు;

        /* i386, sparc64 */
        స్థితి 256:
            preallocate = 7;
            ఆపు;

        /* sparc64 in 32-bit mode */
        అప్రమేయ:
            preallocate = 8;
        }
    }

    ముసుగు = 0;
    inc = 0x80000000;

    అయితే (preallocate--) {

        కీలకం = 0;
        ముసుగు >>= 1;
        ముసుగు |= 0x80000000;

        చేయి {
            ఒకవేళ (ngx_radix32tree_చొప్పించు(వృక్షం, కీలకం, ముసుగు, NGX_RADIX_NO_విలువ)
                != NGX_OK)
            {
                తిరిగి ఖాళీ;
            }

            కీలకం += inc;

        } అయితే (కీలకం);

        inc >>= 1;
    }

    తిరిగి వృక్షం;
}


ngx_int_t
ngx_radix32tree_చొప్పించు(ngx_radix_వృక్షం_t *వృక్షం, uint32_t కీలకం, uint32_t ముసుగు,
    uintptr_t విలువ)
{
    uint32_t           బిట్టు;
    ngx_radix_కణుపు_t  *కణుపు, *తదుపరి;

    బిట్టు = 0x80000000;

    కణుపు = వృక్షం->మూలం;
    తదుపరి = వృక్షం->మూలం;

    అయితే (బిట్టు & ముసుగు) {
        ఒకవేళ (కీలకం & బిట్టు) {
            తదుపరి = కణుపు->కుడి;

        } లేకపోతే {
            తదుపరి = కణుపు->ఎడమ;
        }

        ఒకవేళ (తదుపరి == ఖాళీ) {
            ఆపు;
        }

        బిట్టు >>= 1;
        కణుపు = తదుపరి;
    }

    ఒకవేళ (తదుపరి) {
        ఒకవేళ (కణుపు->విలువ != NGX_RADIX_NO_విలువ) {
            తిరిగి NGX_BUSY;
        }

        కణుపు->విలువ = విలువ;
        తిరిగి NGX_OK;
    }

    అయితే (బిట్టు & ముసుగు) {
        తదుపరి = ngx_radix_alloc(వృక్షం);
        ఒకవేళ (తదుపరి == ఖాళీ) {
            తిరిగి NGX_ERROR;
        }

        తదుపరి->కుడి = ఖాళీ;
        తదుపరి->ఎడమ = ఖాళీ;
        తదుపరి->మాతృ = కణుపు;
        తదుపరి->విలువ = NGX_RADIX_NO_విలువ;

        ఒకవేళ (కీలకం & బిట్టు) {
            కణుపు->కుడి = తదుపరి;

        } లేకపోతే {
            కణుపు->ఎడమ = తదుపరి;
        }

        బిట్టు >>= 1;
        కణుపు = తదుపరి;
    }

    కణుపు->విలువ = విలువ;

    తిరిగి NGX_OK;
}


ngx_int_t
ngx_radix32tree_delete(ngx_radix_వృక్షం_t *వృక్షం, uint32_t కీలకం, uint32_t ముసుగు)
{
    uint32_t           బిట్టు;
    ngx_radix_కణుపు_t  *కణుపు;

    బిట్టు = 0x80000000;
    కణుపు = వృక్షం->మూలం;

    అయితే (కణుపు && (బిట్టు & ముసుగు)) {
        ఒకవేళ (కీలకం & బిట్టు) {
            కణుపు = కణుపు->కుడి;

        } లేకపోతే {
            కణుపు = కణుపు->ఎడమ;
        }

        బిట్టు >>= 1;
    }

    ఒకవేళ (కణుపు == ఖాళీ) {
        తిరిగి NGX_ERROR;
    }

    ఒకవేళ (కణుపు->కుడి || కణుపు->ఎడమ) {
        ఒకవేళ (కణుపు->విలువ != NGX_RADIX_NO_విలువ) {
            కణుపు->విలువ = NGX_RADIX_NO_విలువ;
            తిరిగి NGX_OK;
        }

        తిరిగి NGX_ERROR;
    }

    కొరకు ( ;; ) {
        ఒకవేళ (కణుపు->మాతృ->కుడి == కణుపు) {
            కణుపు->మాతృ->కుడి = ఖాళీ;

        } లేకపోతే {
            కణుపు->మాతృ->ఎడమ = ఖాళీ;
        }

        కణుపు->కుడి = వృక్షం->విడుదల;
        వృక్షం->విడుదల = కణుపు;

        కణుపు = కణుపు->మాతృ;

        ఒకవేళ (కణుపు->కుడి || కణుపు->ఎడమ) {
            ఆపు;
        }

        ఒకవేళ (కణుపు->విలువ != NGX_RADIX_NO_విలువ) {
            ఆపు;
        }

        ఒకవేళ (కణుపు->మాతృ == ఖాళీ) {
            ఆపు;
        }
    }

    తిరిగి NGX_OK;
}


uintptr_t
ngx_radix32tree_కనుగొను(ngx_radix_వృక్షం_t *వృక్షం, uint32_t కీలకం)
{
    uint32_t           బిట్టు;
    uintptr_t          విలువ;
    ngx_radix_కణుపు_t  *కణుపు;

    బిట్టు = 0x80000000;
    విలువ = NGX_RADIX_NO_విలువ;
    కణుపు = వృక్షం->మూలం;

    అయితే (కణుపు) {
        ఒకవేళ (కణుపు->విలువ != NGX_RADIX_NO_విలువ) {
            విలువ = కణుపు->విలువ;
        }

        ఒకవేళ (కీలకం & బిట్టు) {
            కణుపు = కణుపు->కుడి;

        } లేకపోతే {
            కణుపు = కణుపు->ఎడమ;
        }

        బిట్టు >>= 1;
    }

    తిరిగి విలువ;
}


#ఒకవేళ (NGX_HAVE_INET6)

ngx_int_t
ngx_radix128tree_చొప్పించు(ngx_radix_వృక్షం_t *వృక్షం, u_char *కీలకం, u_char *ముసుగు,
    uintptr_t విలువ)
{
    u_char             బిట్టు;
    ngx_uint_t         i;
    ngx_radix_కణుపు_t  *కణుపు, *తదుపరి;

    i = 0;
    బిట్టు = 0x80;

    కణుపు = వృక్షం->మూలం;
    తదుపరి = వృక్షం->మూలం;

    అయితే (బిట్టు & ముసుగు[i]) {
        ఒకవేళ (కీలకం[i] & బిట్టు) {
            తదుపరి = కణుపు->కుడి;

        } లేకపోతే {
            తదుపరి = కణుపు->ఎడమ;
        }

        ఒకవేళ (తదుపరి == ఖాళీ) {
            ఆపు;
        }

        బిట్టు >>= 1;
        కణుపు = తదుపరి;

        ఒకవేళ (బిట్టు == 0) {
            ఒకవేళ (++i == 16) {
                ఆపు;
            }

            బిట్టు = 0x80;
        }
    }

    ఒకవేళ (తదుపరి) {
        ఒకవేళ (కణుపు->విలువ != NGX_RADIX_NO_విలువ) {
            తిరిగి NGX_BUSY;
        }

        కణుపు->విలువ = విలువ;
        తిరిగి NGX_OK;
    }

    అయితే (బిట్టు & ముసుగు[i]) {
        తదుపరి = ngx_radix_alloc(వృక్షం);
        ఒకవేళ (తదుపరి == ఖాళీ) {
            తిరిగి NGX_ERROR;
        }

        తదుపరి->కుడి = ఖాళీ;
        తదుపరి->ఎడమ = ఖాళీ;
        తదుపరి->మాతృ = కణుపు;
        తదుపరి->విలువ = NGX_RADIX_NO_విలువ;

        ఒకవేళ (కీలకం[i] & బిట్టు) {
            కణుపు->కుడి = తదుపరి;

        } లేకపోతే {
            కణుపు->ఎడమ = తదుపరి;
        }

        బిట్టు >>= 1;
        కణుపు = తదుపరి;

        ఒకవేళ (బిట్టు == 0) {
            ఒకవేళ (++i == 16) {
                ఆపు;
            }

            బిట్టు = 0x80;
        }
    }

    కణుపు->విలువ = విలువ;

    తిరిగి NGX_OK;
}


ngx_int_t
ngx_radix128tree_delete(ngx_radix_వృక్షం_t *వృక్షం, u_char *కీలకం, u_char *ముసుగు)
{
    u_char             బిట్టు;
    ngx_uint_t         i;
    ngx_radix_కణుపు_t  *కణుపు;

    i = 0;
    బిట్టు = 0x80;
    కణుపు = వృక్షం->మూలం;

    అయితే (కణుపు && (బిట్టు & ముసుగు[i])) {
        ఒకవేళ (కీలకం[i] & బిట్టు) {
            కణుపు = కణుపు->కుడి;

        } లేకపోతే {
            కణుపు = కణుపు->ఎడమ;
        }

        బిట్టు >>= 1;

        ఒకవేళ (బిట్టు == 0) {
            ఒకవేళ (++i == 16) {
                ఆపు;
            }

            బిట్టు = 0x80;
        }
    }

    ఒకవేళ (కణుపు == ఖాళీ) {
        తిరిగి NGX_ERROR;
    }

    ఒకవేళ (కణుపు->కుడి || కణుపు->ఎడమ) {
        ఒకవేళ (కణుపు->విలువ != NGX_RADIX_NO_విలువ) {
            కణుపు->విలువ = NGX_RADIX_NO_విలువ;
            తిరిగి NGX_OK;
        }

        తిరిగి NGX_ERROR;
    }

    కొరకు ( ;; ) {
        ఒకవేళ (కణుపు->మాతృ->కుడి == కణుపు) {
            కణుపు->మాతృ->కుడి = ఖాళీ;

        } లేకపోతే {
            కణుపు->మాతృ->ఎడమ = ఖాళీ;
        }

        కణుపు->కుడి = వృక్షం->విడుదల;
        వృక్షం->విడుదల = కణుపు;

        కణుపు = కణుపు->మాతృ;

        ఒకవేళ (కణుపు->కుడి || కణుపు->ఎడమ) {
            ఆపు;
        }

        ఒకవేళ (కణుపు->విలువ != NGX_RADIX_NO_విలువ) {
            ఆపు;
        }

        ఒకవేళ (కణుపు->మాతృ == ఖాళీ) {
            ఆపు;
        }
    }

    తిరిగి NGX_OK;
}


uintptr_t
ngx_radix128tree_కనుగొను(ngx_radix_వృక్షం_t *వృక్షం, u_char *కీలకం)
{
    u_char             బిట్టు;
    uintptr_t          విలువ;
    ngx_uint_t         i;
    ngx_radix_కణుపు_t  *కణుపు;

    i = 0;
    బిట్టు = 0x80;
    విలువ = NGX_RADIX_NO_విలువ;
    కణుపు = వృక్షం->మూలం;

    అయితే (కణుపు) {
        ఒకవేళ (కణుపు->విలువ != NGX_RADIX_NO_విలువ) {
            విలువ = కణుపు->విలువ;
        }

        ఒకవేళ (కీలకం[i] & బిట్టు) {
            కణుపు = కణుపు->కుడి;

        } లేకపోతే {
            కణుపు = కణుపు->ఎడమ;
        }

        బిట్టు >>= 1;

        ఒకవేళ (బిట్టు == 0) {
            i++;
            బిట్టు = 0x80;
        }
    }

    తిరిగి విలువ;
}

#అయితే_ముగింపు


స్థిర ngx_radix_కణుపు_t *
ngx_radix_alloc(ngx_radix_వృక్షం_t *వృక్షం)
{
    ngx_radix_కణుపు_t  *p;

    ఒకవేళ (వృక్షం->విడుదల) {
        p = వృక్షం->విడుదల;
        వృక్షం->విడుదల = వృక్షం->విడుదల->కుడి;
        తిరిగి p;
    }

    ఒకవేళ (వృక్షం->కొలత < పరిమాణం(ngx_radix_కణుపు_t)) {
        వృక్షం->ప్రారంభం = ngx_pmemalign(వృక్షం->pool, ngx_pagesize, ngx_pagesize);
        ఒకవేళ (వృక్షం->ప్రారంభం == ఖాళీ) {
            తిరిగి ఖాళీ;
        }

        వృక్షం->కొలత = ngx_pagesize;
    }

    p = (ngx_radix_కణుపు_t *) వృక్షం->ప్రారంభం;
    వృక్షం->ప్రారంభం += పరిమాణం(ngx_radix_కణుపు_t);
    వృక్షం->కొలత -= పరిమాణం(ngx_radix_కణుపు_t);

    తిరిగి p;
}
