
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#شامل <ngx_config.h>
#شامل <ngx_core.h>


ساکن ngx_radix_گرہ_t *ngx_radix_alloc(ngx_radix_درخت_t *درخت);


ngx_radix_درخت_t *
ngx_radix_درخت_create(ngx_pool_t *pool, ngx_int_t preallocate)
{
    uint32_t           کلید, نقاب, inc;
    ngx_radix_درخت_t  *درخت;

    درخت = ngx_palloc(pool, حجم(ngx_radix_درخت_t));
    اگر (درخت == تہی) {
        واپس تہی;
    }

    درخت->pool = pool;
    درخت->آزاد = تہی;
    درخت->آغاز = تہی;
    درخت->سائز = 0;

    درخت->جڑ = ngx_radix_alloc(درخت);
    اگر (درخت->جڑ == تہی) {
        واپس تہی;
    }

    درخت->جڑ->دایاں = تہی;
    درخت->جڑ->بایاں = تہی;
    درخت->جڑ->والد = تہی;
    درخت->جڑ->قدر = NGX_RADIX_NO_قدر;

    اگر (preallocate == 0) {
        واپس درخت;
    }

    /*
     * Preallocation of first nodes : 0, 1, 00, 01, 10, 11, 000, 001, etc.
     * increases TLB hits even if for first lookup iterations.
     * On 32-bit platforms the 7 preallocated bits takes continuous 4K,
     * 8 - 8K, 9 - 16K, etc.  On 64-bit platforms the 6 preallocated bits
     * takes continuous 4K, 7 - 8K, 8 - 16K, etc.  There is no sense to
     * to preallocate more than one page, because further preallocation
     * distributes the only bit per page.  Instead, a random insertion
     * may distribute several bits per page.
     *
     * Thus, by default we preallocate maximum
     *     6 bits on amd64 (64-bit platform and 4K pages)
     *     7 bits on i386 (32-bit platform and 4K pages)
     *     7 bits on sparc64 in 64-bit mode (8K pages)
     *     8 bits on sparc64 in 32-bit mode (8K pages)
     */

    اگر (preallocate == -1) {
        انتخاب (ngx_pagesize / حجم(ngx_radix_گرہ_t)) {

        /* amd64 */
        حالت 128:
            preallocate = 6;
            توڑو;

        /* i386, sparc64 */
        حالت 256:
            preallocate = 7;
            توڑو;

        /* sparc64 in 32-bit mode */
        طےشدہ:
            preallocate = 8;
        }
    }

    نقاب = 0;
    inc = 0x80000000;

    جب (preallocate--) {

        کلید = 0;
        نقاب >>= 1;
        نقاب |= 0x80000000;

        کرو {
            اگر (ngx_radix32tree_داخل_کرو(درخت, کلید, نقاب, NGX_RADIX_NO_قدر)
                != NGX_OK)
            {
                واپس تہی;
            }

            کلید += inc;

        } جب (کلید);

        inc >>= 1;
    }

    واپس درخت;
}


ngx_int_t
ngx_radix32tree_داخل_کرو(ngx_radix_درخت_t *درخت, uint32_t کلید, uint32_t نقاب,
    uintptr_t قدر)
{
    uint32_t           ثنائی_ہندسہ;
    ngx_radix_گرہ_t  *گرہ, *اگلا;

    ثنائی_ہندسہ = 0x80000000;

    گرہ = درخت->جڑ;
    اگلا = درخت->جڑ;

    جب (ثنائی_ہندسہ & نقاب) {
        اگر (کلید & ثنائی_ہندسہ) {
            اگلا = گرہ->دایاں;

        } ورنہ {
            اگلا = گرہ->بایاں;
        }

        اگر (اگلا == تہی) {
            توڑو;
        }

        ثنائی_ہندسہ >>= 1;
        گرہ = اگلا;
    }

    اگر (اگلا) {
        اگر (گرہ->قدر != NGX_RADIX_NO_قدر) {
            واپس NGX_BUSY;
        }

        گرہ->قدر = قدر;
        واپس NGX_OK;
    }

    جب (ثنائی_ہندسہ & نقاب) {
        اگلا = ngx_radix_alloc(درخت);
        اگر (اگلا == تہی) {
            واپس NGX_ERROR;
        }

        اگلا->دایاں = تہی;
        اگلا->بایاں = تہی;
        اگلا->والد = گرہ;
        اگلا->قدر = NGX_RADIX_NO_قدر;

        اگر (کلید & ثنائی_ہندسہ) {
            گرہ->دایاں = اگلا;

        } ورنہ {
            گرہ->بایاں = اگلا;
        }

        ثنائی_ہندسہ >>= 1;
        گرہ = اگلا;
    }

    گرہ->قدر = قدر;

    واپس NGX_OK;
}


ngx_int_t
ngx_radix32tree_delete(ngx_radix_درخت_t *درخت, uint32_t کلید, uint32_t نقاب)
{
    uint32_t           ثنائی_ہندسہ;
    ngx_radix_گرہ_t  *گرہ;

    ثنائی_ہندسہ = 0x80000000;
    گرہ = درخت->جڑ;

    جب (گرہ && (ثنائی_ہندسہ & نقاب)) {
        اگر (کلید & ثنائی_ہندسہ) {
            گرہ = گرہ->دایاں;

        } ورنہ {
            گرہ = گرہ->بایاں;
        }

        ثنائی_ہندسہ >>= 1;
    }

    اگر (گرہ == تہی) {
        واپس NGX_ERROR;
    }

    اگر (گرہ->دایاں || گرہ->بایاں) {
        اگر (گرہ->قدر != NGX_RADIX_NO_قدر) {
            گرہ->قدر = NGX_RADIX_NO_قدر;
            واپس NGX_OK;
        }

        واپس NGX_ERROR;
    }

    برائے ( ;; ) {
        اگر (گرہ->والد->دایاں == گرہ) {
            گرہ->والد->دایاں = تہی;

        } ورنہ {
            گرہ->والد->بایاں = تہی;
        }

        گرہ->دایاں = درخت->آزاد;
        درخت->آزاد = گرہ;

        گرہ = گرہ->والد;

        اگر (گرہ->دایاں || گرہ->بایاں) {
            توڑو;
        }

        اگر (گرہ->قدر != NGX_RADIX_NO_قدر) {
            توڑو;
        }

        اگر (گرہ->والد == تہی) {
            توڑو;
        }
    }

    واپس NGX_OK;
}


uintptr_t
ngx_radix32tree_ڈھونڈو(ngx_radix_درخت_t *درخت, uint32_t کلید)
{
    uint32_t           ثنائی_ہندسہ;
    uintptr_t          قدر;
    ngx_radix_گرہ_t  *گرہ;

    ثنائی_ہندسہ = 0x80000000;
    قدر = NGX_RADIX_NO_قدر;
    گرہ = درخت->جڑ;

    جب (گرہ) {
        اگر (گرہ->قدر != NGX_RADIX_NO_قدر) {
            قدر = گرہ->قدر;
        }

        اگر (کلید & ثنائی_ہندسہ) {
            گرہ = گرہ->دایاں;

        } ورنہ {
            گرہ = گرہ->بایاں;
        }

        ثنائی_ہندسہ >>= 1;
    }

    واپس قدر;
}


#اگر (NGX_HAVE_INET6)

ngx_int_t
ngx_radix128tree_داخل_کرو(ngx_radix_درخت_t *درخت, u_char *کلید, u_char *نقاب,
    uintptr_t قدر)
{
    u_char             ثنائی_ہندسہ;
    ngx_uint_t         i;
    ngx_radix_گرہ_t  *گرہ, *اگلا;

    i = 0;
    ثنائی_ہندسہ = 0x80;

    گرہ = درخت->جڑ;
    اگلا = درخت->جڑ;

    جب (ثنائی_ہندسہ & نقاب[i]) {
        اگر (کلید[i] & ثنائی_ہندسہ) {
            اگلا = گرہ->دایاں;

        } ورنہ {
            اگلا = گرہ->بایاں;
        }

        اگر (اگلا == تہی) {
            توڑو;
        }

        ثنائی_ہندسہ >>= 1;
        گرہ = اگلا;

        اگر (ثنائی_ہندسہ == 0) {
            اگر (++i == 16) {
                توڑو;
            }

            ثنائی_ہندسہ = 0x80;
        }
    }

    اگر (اگلا) {
        اگر (گرہ->قدر != NGX_RADIX_NO_قدر) {
            واپس NGX_BUSY;
        }

        گرہ->قدر = قدر;
        واپس NGX_OK;
    }

    جب (ثنائی_ہندسہ & نقاب[i]) {
        اگلا = ngx_radix_alloc(درخت);
        اگر (اگلا == تہی) {
            واپس NGX_ERROR;
        }

        اگلا->دایاں = تہی;
        اگلا->بایاں = تہی;
        اگلا->والد = گرہ;
        اگلا->قدر = NGX_RADIX_NO_قدر;

        اگر (کلید[i] & ثنائی_ہندسہ) {
            گرہ->دایاں = اگلا;

        } ورنہ {
            گرہ->بایاں = اگلا;
        }

        ثنائی_ہندسہ >>= 1;
        گرہ = اگلا;

        اگر (ثنائی_ہندسہ == 0) {
            اگر (++i == 16) {
                توڑو;
            }

            ثنائی_ہندسہ = 0x80;
        }
    }

    گرہ->قدر = قدر;

    واپس NGX_OK;
}


ngx_int_t
ngx_radix128tree_delete(ngx_radix_درخت_t *درخت, u_char *کلید, u_char *نقاب)
{
    u_char             ثنائی_ہندسہ;
    ngx_uint_t         i;
    ngx_radix_گرہ_t  *گرہ;

    i = 0;
    ثنائی_ہندسہ = 0x80;
    گرہ = درخت->جڑ;

    جب (گرہ && (ثنائی_ہندسہ & نقاب[i])) {
        اگر (کلید[i] & ثنائی_ہندسہ) {
            گرہ = گرہ->دایاں;

        } ورنہ {
            گرہ = گرہ->بایاں;
        }

        ثنائی_ہندسہ >>= 1;

        اگر (ثنائی_ہندسہ == 0) {
            اگر (++i == 16) {
                توڑو;
            }

            ثنائی_ہندسہ = 0x80;
        }
    }

    اگر (گرہ == تہی) {
        واپس NGX_ERROR;
    }

    اگر (گرہ->دایاں || گرہ->بایاں) {
        اگر (گرہ->قدر != NGX_RADIX_NO_قدر) {
            گرہ->قدر = NGX_RADIX_NO_قدر;
            واپس NGX_OK;
        }

        واپس NGX_ERROR;
    }

    برائے ( ;; ) {
        اگر (گرہ->والد->دایاں == گرہ) {
            گرہ->والد->دایاں = تہی;

        } ورنہ {
            گرہ->والد->بایاں = تہی;
        }

        گرہ->دایاں = درخت->آزاد;
        درخت->آزاد = گرہ;

        گرہ = گرہ->والد;

        اگر (گرہ->دایاں || گرہ->بایاں) {
            توڑو;
        }

        اگر (گرہ->قدر != NGX_RADIX_NO_قدر) {
            توڑو;
        }

        اگر (گرہ->والد == تہی) {
            توڑو;
        }
    }

    واپس NGX_OK;
}


uintptr_t
ngx_radix128tree_ڈھونڈو(ngx_radix_درخت_t *درخت, u_char *کلید)
{
    u_char             ثنائی_ہندسہ;
    uintptr_t          قدر;
    ngx_uint_t         i;
    ngx_radix_گرہ_t  *گرہ;

    i = 0;
    ثنائی_ہندسہ = 0x80;
    قدر = NGX_RADIX_NO_قدر;
    گرہ = درخت->جڑ;

    جب (گرہ) {
        اگر (گرہ->قدر != NGX_RADIX_NO_قدر) {
            قدر = گرہ->قدر;
        }

        اگر (کلید[i] & ثنائی_ہندسہ) {
            گرہ = گرہ->دایاں;

        } ورنہ {
            گرہ = گرہ->بایاں;
        }

        ثنائی_ہندسہ >>= 1;

        اگر (ثنائی_ہندسہ == 0) {
            i++;
            ثنائی_ہندسہ = 0x80;
        }
    }

    واپس قدر;
}

#اگر_ختم


ساکن ngx_radix_گرہ_t *
ngx_radix_alloc(ngx_radix_درخت_t *درخت)
{
    ngx_radix_گرہ_t  *p;

    اگر (درخت->آزاد) {
        p = درخت->آزاد;
        درخت->آزاد = درخت->آزاد->دایاں;
        واپس p;
    }

    اگر (درخت->سائز < حجم(ngx_radix_گرہ_t)) {
        درخت->آغاز = ngx_pmemalign(درخت->pool, ngx_pagesize, ngx_pagesize);
        اگر (درخت->آغاز == تہی) {
            واپس تہی;
        }

        درخت->سائز = ngx_pagesize;
    }

    p = (ngx_radix_گرہ_t *) درخت->آغاز;
    درخت->آغاز += حجم(ngx_radix_گرہ_t);
    درخت->سائز -= حجم(ngx_radix_گرہ_t);

    واپس p;
}
