
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#ਅਨ੍ਤਰ੍ਭਾਵ <ngx_config.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <ngx_core.h>


ਸਥਿਰ ngx_radix_ਗੰਢ_t *ngx_radix_alloc(ngx_radix_ਰੁੱਖ_t *ਰੁੱਖ);


ngx_radix_ਰੁੱਖ_t *
ngx_radix_ਰੁੱਖ_create(ngx_pool_t *pool, ngx_int_t preallocate)
{
    uint32_t           ਕੁੰਜੀ, ਨਕਾਬ, inc;
    ngx_radix_ਰੁੱਖ_t  *ਰੁੱਖ;

    ਰੁੱਖ = ngx_palloc(pool, ਆਕਾਰ(ngx_radix_ਰੁੱਖ_t));
    ਜੇ (ਰੁੱਖ == ਨਿਰਾ) {
        ਵਾਪਸ ਨਿਰਾ;
    }

    ਰੁੱਖ->pool = pool;
    ਰੁੱਖ->ਮੁਕਤ = ਨਿਰਾ;
    ਰੁੱਖ->ਸ਼ੁਰੂ = ਨਿਰਾ;
    ਰੁੱਖ->ਮਾਪ = 0;

    ਰੁੱਖ->ਜੜ੍ਹ = ngx_radix_alloc(ਰੁੱਖ);
    ਜੇ (ਰੁੱਖ->ਜੜ੍ਹ == ਨਿਰਾ) {
        ਵਾਪਸ ਨਿਰਾ;
    }

    ਰੁੱਖ->ਜੜ੍ਹ->ਸੱਜਾ = ਨਿਰਾ;
    ਰੁੱਖ->ਜੜ੍ਹ->ਖੱਬਾ = ਨਿਰਾ;
    ਰੁੱਖ->ਜੜ੍ਹ->ਮਾਪਾ = ਨਿਰਾ;
    ਰੁੱਖ->ਜੜ੍ਹ->ਮੁੱਲ = NGX_RADIX_NO_ਮੁੱਲ;

    ਜੇ (preallocate == 0) {
        ਵਾਪਸ ਰੁੱਖ;
    }

    /*
     * Preallocation of first nodes : 0, 1, 00, 01, 10, 11, 000, 001, etc.
     * increases TLB hits even if for first lookup iterations.
     * On 32-bit platforms the 7 preallocated bits takes continuous 4K,
     * 8 - 8K, 9 - 16K, etc.  On 64-bit platforms the 6 preallocated bits
     * takes continuous 4K, 7 - 8K, 8 - 16K, etc.  There is no sense to
     * to preallocate more than one page, because further preallocation
     * distributes the only bit per page.  Instead, a random insertion
     * may distribute several bits per page.
     *
     * Thus, by default we preallocate maximum
     *     6 bits on amd64 (64-bit platform and 4K pages)
     *     7 bits on i386 (32-bit platform and 4K pages)
     *     7 bits on sparc64 in 64-bit mode (8K pages)
     *     8 bits on sparc64 in 32-bit mode (8K pages)
     */

    ਜੇ (preallocate == -1) {
        ਚੋਣ (ngx_pagesize / ਆਕਾਰ(ngx_radix_ਗੰਢ_t)) {

        /* amd64 */
        ਹਾਲਤ 128:
            preallocate = 6;
            ਰੋਕੋ;

        /* i386, sparc64 */
        ਹਾਲਤ 256:
            preallocate = 7;
            ਰੋਕੋ;

        /* sparc64 in 32-bit mode */
        ਮੂਲ:
            preallocate = 8;
        }
    }

    ਨਕਾਬ = 0;
    inc = 0x80000000;

    ਜਦੋਂ (preallocate--) {

        ਕੁੰਜੀ = 0;
        ਨਕਾਬ >>= 1;
        ਨਕਾਬ |= 0x80000000;

        ਕਰੋ {
            ਜੇ (ngx_radix32tree_ਪਾਓ(ਰੁੱਖ, ਕੁੰਜੀ, ਨਕਾਬ, NGX_RADIX_NO_ਮੁੱਲ)
                != NGX_OK)
            {
                ਵਾਪਸ ਨਿਰਾ;
            }

            ਕੁੰਜੀ += inc;

        } ਜਦੋਂ (ਕੁੰਜੀ);

        inc >>= 1;
    }

    ਵਾਪਸ ਰੁੱਖ;
}


ngx_int_t
ngx_radix32tree_ਪਾਓ(ngx_radix_ਰੁੱਖ_t *ਰੁੱਖ, uint32_t ਕੁੰਜੀ, uint32_t ਨਕਾਬ,
    uintptr_t ਮੁੱਲ)
{
    uint32_t           ਦੋਆਧਾਰੀ_ਅੰਕ;
    ngx_radix_ਗੰਢ_t  *ਗੰਢ, *ਅਗਲਾ;

    ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80000000;

    ਗੰਢ = ਰੁੱਖ->ਜੜ੍ਹ;
    ਅਗਲਾ = ਰੁੱਖ->ਜੜ੍ਹ;

    ਜਦੋਂ (ਦੋਆਧਾਰੀ_ਅੰਕ & ਨਕਾਬ) {
        ਜੇ (ਕੁੰਜੀ & ਦੋਆਧਾਰੀ_ਅੰਕ) {
            ਅਗਲਾ = ਗੰਢ->ਸੱਜਾ;

        } ਨਹੀਂਤਾਂ {
            ਅਗਲਾ = ਗੰਢ->ਖੱਬਾ;
        }

        ਜੇ (ਅਗਲਾ == ਨਿਰਾ) {
            ਰੋਕੋ;
        }

        ਦੋਆਧਾਰੀ_ਅੰਕ >>= 1;
        ਗੰਢ = ਅਗਲਾ;
    }

    ਜੇ (ਅਗਲਾ) {
        ਜੇ (ਗੰਢ->ਮੁੱਲ != NGX_RADIX_NO_ਮੁੱਲ) {
            ਵਾਪਸ NGX_BUSY;
        }

        ਗੰਢ->ਮੁੱਲ = ਮੁੱਲ;
        ਵਾਪਸ NGX_OK;
    }

    ਜਦੋਂ (ਦੋਆਧਾਰੀ_ਅੰਕ & ਨਕਾਬ) {
        ਅਗਲਾ = ngx_radix_alloc(ਰੁੱਖ);
        ਜੇ (ਅਗਲਾ == ਨਿਰਾ) {
            ਵਾਪਸ NGX_ERROR;
        }

        ਅਗਲਾ->ਸੱਜਾ = ਨਿਰਾ;
        ਅਗਲਾ->ਖੱਬਾ = ਨਿਰਾ;
        ਅਗਲਾ->ਮਾਪਾ = ਗੰਢ;
        ਅਗਲਾ->ਮੁੱਲ = NGX_RADIX_NO_ਮੁੱਲ;

        ਜੇ (ਕੁੰਜੀ & ਦੋਆਧਾਰੀ_ਅੰਕ) {
            ਗੰਢ->ਸੱਜਾ = ਅਗਲਾ;

        } ਨਹੀਂਤਾਂ {
            ਗੰਢ->ਖੱਬਾ = ਅਗਲਾ;
        }

        ਦੋਆਧਾਰੀ_ਅੰਕ >>= 1;
        ਗੰਢ = ਅਗਲਾ;
    }

    ਗੰਢ->ਮੁੱਲ = ਮੁੱਲ;

    ਵਾਪਸ NGX_OK;
}


ngx_int_t
ngx_radix32tree_delete(ngx_radix_ਰੁੱਖ_t *ਰੁੱਖ, uint32_t ਕੁੰਜੀ, uint32_t ਨਕਾਬ)
{
    uint32_t           ਦੋਆਧਾਰੀ_ਅੰਕ;
    ngx_radix_ਗੰਢ_t  *ਗੰਢ;

    ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80000000;
    ਗੰਢ = ਰੁੱਖ->ਜੜ੍ਹ;

    ਜਦੋਂ (ਗੰਢ && (ਦੋਆਧਾਰੀ_ਅੰਕ & ਨਕਾਬ)) {
        ਜੇ (ਕੁੰਜੀ & ਦੋਆਧਾਰੀ_ਅੰਕ) {
            ਗੰਢ = ਗੰਢ->ਸੱਜਾ;

        } ਨਹੀਂਤਾਂ {
            ਗੰਢ = ਗੰਢ->ਖੱਬਾ;
        }

        ਦੋਆਧਾਰੀ_ਅੰਕ >>= 1;
    }

    ਜੇ (ਗੰਢ == ਨਿਰਾ) {
        ਵਾਪਸ NGX_ERROR;
    }

    ਜੇ (ਗੰਢ->ਸੱਜਾ || ਗੰਢ->ਖੱਬਾ) {
        ਜੇ (ਗੰਢ->ਮੁੱਲ != NGX_RADIX_NO_ਮੁੱਲ) {
            ਗੰਢ->ਮੁੱਲ = NGX_RADIX_NO_ਮੁੱਲ;
            ਵਾਪਸ NGX_OK;
        }

        ਵਾਪਸ NGX_ERROR;
    }

    ਲਈ ( ;; ) {
        ਜੇ (ਗੰਢ->ਮਾਪਾ->ਸੱਜਾ == ਗੰਢ) {
            ਗੰਢ->ਮਾਪਾ->ਸੱਜਾ = ਨਿਰਾ;

        } ਨਹੀਂਤਾਂ {
            ਗੰਢ->ਮਾਪਾ->ਖੱਬਾ = ਨਿਰਾ;
        }

        ਗੰਢ->ਸੱਜਾ = ਰੁੱਖ->ਮੁਕਤ;
        ਰੁੱਖ->ਮੁਕਤ = ਗੰਢ;

        ਗੰਢ = ਗੰਢ->ਮਾਪਾ;

        ਜੇ (ਗੰਢ->ਸੱਜਾ || ਗੰਢ->ਖੱਬਾ) {
            ਰੋਕੋ;
        }

        ਜੇ (ਗੰਢ->ਮੁੱਲ != NGX_RADIX_NO_ਮੁੱਲ) {
            ਰੋਕੋ;
        }

        ਜੇ (ਗੰਢ->ਮਾਪਾ == ਨਿਰਾ) {
            ਰੋਕੋ;
        }
    }

    ਵਾਪਸ NGX_OK;
}


uintptr_t
ngx_radix32tree_ਲੱਭੋ(ngx_radix_ਰੁੱਖ_t *ਰੁੱਖ, uint32_t ਕੁੰਜੀ)
{
    uint32_t           ਦੋਆਧਾਰੀ_ਅੰਕ;
    uintptr_t          ਮੁੱਲ;
    ngx_radix_ਗੰਢ_t  *ਗੰਢ;

    ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80000000;
    ਮੁੱਲ = NGX_RADIX_NO_ਮੁੱਲ;
    ਗੰਢ = ਰੁੱਖ->ਜੜ੍ਹ;

    ਜਦੋਂ (ਗੰਢ) {
        ਜੇ (ਗੰਢ->ਮੁੱਲ != NGX_RADIX_NO_ਮੁੱਲ) {
            ਮੁੱਲ = ਗੰਢ->ਮੁੱਲ;
        }

        ਜੇ (ਕੁੰਜੀ & ਦੋਆਧਾਰੀ_ਅੰਕ) {
            ਗੰਢ = ਗੰਢ->ਸੱਜਾ;

        } ਨਹੀਂਤਾਂ {
            ਗੰਢ = ਗੰਢ->ਖੱਬਾ;
        }

        ਦੋਆਧਾਰੀ_ਅੰਕ >>= 1;
    }

    ਵਾਪਸ ਮੁੱਲ;
}


#ਜੇ (NGX_HAVE_INET6)

ngx_int_t
ngx_radix128tree_ਪਾਓ(ngx_radix_ਰੁੱਖ_t *ਰੁੱਖ, u_char *ਕੁੰਜੀ, u_char *ਨਕਾਬ,
    uintptr_t ਮੁੱਲ)
{
    u_char             ਦੋਆਧਾਰੀ_ਅੰਕ;
    ngx_uint_t         i;
    ngx_radix_ਗੰਢ_t  *ਗੰਢ, *ਅਗਲਾ;

    i = 0;
    ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80;

    ਗੰਢ = ਰੁੱਖ->ਜੜ੍ਹ;
    ਅਗਲਾ = ਰੁੱਖ->ਜੜ੍ਹ;

    ਜਦੋਂ (ਦੋਆਧਾਰੀ_ਅੰਕ & ਨਕਾਬ[i]) {
        ਜੇ (ਕੁੰਜੀ[i] & ਦੋਆਧਾਰੀ_ਅੰਕ) {
            ਅਗਲਾ = ਗੰਢ->ਸੱਜਾ;

        } ਨਹੀਂਤਾਂ {
            ਅਗਲਾ = ਗੰਢ->ਖੱਬਾ;
        }

        ਜੇ (ਅਗਲਾ == ਨਿਰਾ) {
            ਰੋਕੋ;
        }

        ਦੋਆਧਾਰੀ_ਅੰਕ >>= 1;
        ਗੰਢ = ਅਗਲਾ;

        ਜੇ (ਦੋਆਧਾਰੀ_ਅੰਕ == 0) {
            ਜੇ (++i == 16) {
                ਰੋਕੋ;
            }

            ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80;
        }
    }

    ਜੇ (ਅਗਲਾ) {
        ਜੇ (ਗੰਢ->ਮੁੱਲ != NGX_RADIX_NO_ਮੁੱਲ) {
            ਵਾਪਸ NGX_BUSY;
        }

        ਗੰਢ->ਮੁੱਲ = ਮੁੱਲ;
        ਵਾਪਸ NGX_OK;
    }

    ਜਦੋਂ (ਦੋਆਧਾਰੀ_ਅੰਕ & ਨਕਾਬ[i]) {
        ਅਗਲਾ = ngx_radix_alloc(ਰੁੱਖ);
        ਜੇ (ਅਗਲਾ == ਨਿਰਾ) {
            ਵਾਪਸ NGX_ERROR;
        }

        ਅਗਲਾ->ਸੱਜਾ = ਨਿਰਾ;
        ਅਗਲਾ->ਖੱਬਾ = ਨਿਰਾ;
        ਅਗਲਾ->ਮਾਪਾ = ਗੰਢ;
        ਅਗਲਾ->ਮੁੱਲ = NGX_RADIX_NO_ਮੁੱਲ;

        ਜੇ (ਕੁੰਜੀ[i] & ਦੋਆਧਾਰੀ_ਅੰਕ) {
            ਗੰਢ->ਸੱਜਾ = ਅਗਲਾ;

        } ਨਹੀਂਤਾਂ {
            ਗੰਢ->ਖੱਬਾ = ਅਗਲਾ;
        }

        ਦੋਆਧਾਰੀ_ਅੰਕ >>= 1;
        ਗੰਢ = ਅਗਲਾ;

        ਜੇ (ਦੋਆਧਾਰੀ_ਅੰਕ == 0) {
            ਜੇ (++i == 16) {
                ਰੋਕੋ;
            }

            ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80;
        }
    }

    ਗੰਢ->ਮੁੱਲ = ਮੁੱਲ;

    ਵਾਪਸ NGX_OK;
}


ngx_int_t
ngx_radix128tree_delete(ngx_radix_ਰੁੱਖ_t *ਰੁੱਖ, u_char *ਕੁੰਜੀ, u_char *ਨਕਾਬ)
{
    u_char             ਦੋਆਧਾਰੀ_ਅੰਕ;
    ngx_uint_t         i;
    ngx_radix_ਗੰਢ_t  *ਗੰਢ;

    i = 0;
    ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80;
    ਗੰਢ = ਰੁੱਖ->ਜੜ੍ਹ;

    ਜਦੋਂ (ਗੰਢ && (ਦੋਆਧਾਰੀ_ਅੰਕ & ਨਕਾਬ[i])) {
        ਜੇ (ਕੁੰਜੀ[i] & ਦੋਆਧਾਰੀ_ਅੰਕ) {
            ਗੰਢ = ਗੰਢ->ਸੱਜਾ;

        } ਨਹੀਂਤਾਂ {
            ਗੰਢ = ਗੰਢ->ਖੱਬਾ;
        }

        ਦੋਆਧਾਰੀ_ਅੰਕ >>= 1;

        ਜੇ (ਦੋਆਧਾਰੀ_ਅੰਕ == 0) {
            ਜੇ (++i == 16) {
                ਰੋਕੋ;
            }

            ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80;
        }
    }

    ਜੇ (ਗੰਢ == ਨਿਰਾ) {
        ਵਾਪਸ NGX_ERROR;
    }

    ਜੇ (ਗੰਢ->ਸੱਜਾ || ਗੰਢ->ਖੱਬਾ) {
        ਜੇ (ਗੰਢ->ਮੁੱਲ != NGX_RADIX_NO_ਮੁੱਲ) {
            ਗੰਢ->ਮੁੱਲ = NGX_RADIX_NO_ਮੁੱਲ;
            ਵਾਪਸ NGX_OK;
        }

        ਵਾਪਸ NGX_ERROR;
    }

    ਲਈ ( ;; ) {
        ਜੇ (ਗੰਢ->ਮਾਪਾ->ਸੱਜਾ == ਗੰਢ) {
            ਗੰਢ->ਮਾਪਾ->ਸੱਜਾ = ਨਿਰਾ;

        } ਨਹੀਂਤਾਂ {
            ਗੰਢ->ਮਾਪਾ->ਖੱਬਾ = ਨਿਰਾ;
        }

        ਗੰਢ->ਸੱਜਾ = ਰੁੱਖ->ਮੁਕਤ;
        ਰੁੱਖ->ਮੁਕਤ = ਗੰਢ;

        ਗੰਢ = ਗੰਢ->ਮਾਪਾ;

        ਜੇ (ਗੰਢ->ਸੱਜਾ || ਗੰਢ->ਖੱਬਾ) {
            ਰੋਕੋ;
        }

        ਜੇ (ਗੰਢ->ਮੁੱਲ != NGX_RADIX_NO_ਮੁੱਲ) {
            ਰੋਕੋ;
        }

        ਜੇ (ਗੰਢ->ਮਾਪਾ == ਨਿਰਾ) {
            ਰੋਕੋ;
        }
    }

    ਵਾਪਸ NGX_OK;
}


uintptr_t
ngx_radix128tree_ਲੱਭੋ(ngx_radix_ਰੁੱਖ_t *ਰੁੱਖ, u_char *ਕੁੰਜੀ)
{
    u_char             ਦੋਆਧਾਰੀ_ਅੰਕ;
    uintptr_t          ਮੁੱਲ;
    ngx_uint_t         i;
    ngx_radix_ਗੰਢ_t  *ਗੰਢ;

    i = 0;
    ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80;
    ਮੁੱਲ = NGX_RADIX_NO_ਮੁੱਲ;
    ਗੰਢ = ਰੁੱਖ->ਜੜ੍ਹ;

    ਜਦੋਂ (ਗੰਢ) {
        ਜੇ (ਗੰਢ->ਮੁੱਲ != NGX_RADIX_NO_ਮੁੱਲ) {
            ਮੁੱਲ = ਗੰਢ->ਮੁੱਲ;
        }

        ਜੇ (ਕੁੰਜੀ[i] & ਦੋਆਧਾਰੀ_ਅੰਕ) {
            ਗੰਢ = ਗੰਢ->ਸੱਜਾ;

        } ਨਹੀਂਤਾਂ {
            ਗੰਢ = ਗੰਢ->ਖੱਬਾ;
        }

        ਦੋਆਧਾਰੀ_ਅੰਕ >>= 1;

        ਜੇ (ਦੋਆਧਾਰੀ_ਅੰਕ == 0) {
            i++;
            ਦੋਆਧਾਰੀ_ਅੰਕ = 0x80;
        }
    }

    ਵਾਪਸ ਮੁੱਲ;
}

#ਜੇ_ਅੰਤ


ਸਥਿਰ ngx_radix_ਗੰਢ_t *
ngx_radix_alloc(ngx_radix_ਰੁੱਖ_t *ਰੁੱਖ)
{
    ngx_radix_ਗੰਢ_t  *p;

    ਜੇ (ਰੁੱਖ->ਮੁਕਤ) {
        p = ਰੁੱਖ->ਮੁਕਤ;
        ਰੁੱਖ->ਮੁਕਤ = ਰੁੱਖ->ਮੁਕਤ->ਸੱਜਾ;
        ਵਾਪਸ p;
    }

    ਜੇ (ਰੁੱਖ->ਮਾਪ < ਆਕਾਰ(ngx_radix_ਗੰਢ_t)) {
        ਰੁੱਖ->ਸ਼ੁਰੂ = ngx_pmemalign(ਰੁੱਖ->pool, ngx_pagesize, ngx_pagesize);
        ਜੇ (ਰੁੱਖ->ਸ਼ੁਰੂ == ਨਿਰਾ) {
            ਵਾਪਸ ਨਿਰਾ;
        }

        ਰੁੱਖ->ਮਾਪ = ngx_pagesize;
    }

    p = (ngx_radix_ਗੰਢ_t *) ਰੁੱਖ->ਸ਼ੁਰੂ;
    ਰੁੱਖ->ਸ਼ੁਰੂ += ਆਕਾਰ(ngx_radix_ਗੰਢ_t);
    ਰੁੱਖ->ਮਾਪ -= ਆਕਾਰ(ngx_radix_ਗੰਢ_t);

    ਵਾਪਸ p;
}
