
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#ಅನ್ತರ್ಭಾವ <ngx_config.h>
#ಅನ್ತರ್ಭಾವ <ngx_core.h>


#ವ್ಯಾಖ್ಯಾನಿತವಾಗದಿದ್ದರೆ NGX_ಸರತಿ_H_INCLUDED
#ವ್ಯಾಖ್ಯಾನಿಸು NGX_ಸರತಿ_H_INCLUDED


ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ರಚನೆ ngx_ಸರತಿ_s  ngx_ಸರತಿ_t;

ರಚನೆ ngx_ಸರತಿ_s {
    ngx_ಸರತಿ_t  *prev;
    ngx_ಸರತಿ_t  *ಮುಂದಿನ;
};


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_init(q)                                                     \
    (q)->prev = q;                                                            \
    (q)->ಮುಂದಿನ = q


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ಖಾಲಿಗಳು(h)                                                    \
    (h == (h)->prev)


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ಸೇರಿಸು_ತಲೆ(h, x)                                           \
    (x)->ಮುಂದಿನ = (h)->ಮುಂದಿನ;                                                    \
    (x)->ಮುಂದಿನ->prev = x;                                                      \
    (x)->prev = h;                                                            \
    (h)->ಮುಂದಿನ = x


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ಸೇರಿಸು_after   ngx_ಸರತಿ_ಸೇರಿಸು_ತಲೆ


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ಸೇರಿಸು_ಬಾಲ(h, x)                                           \
    (x)->prev = (h)->prev;                                                    \
    (x)->prev->ಮುಂದಿನ = x;                                                      \
    (x)->ಮುಂದಿನ = h;                                                            \
    (h)->prev = x


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ಸೇರಿಸು_before   ngx_ಸರತಿ_ಸೇರಿಸು_ಬಾಲ


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ತಲೆ(h)                                                     \
    (h)->ಮುಂದಿನ


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ಕೊನೆಯ(h)                                                     \
    (h)->prev


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_sentinel(h)                                                 \
    (h)


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ಮುಂದಿನ(q)                                                     \
    (q)->ಮುಂದಿನ


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_prev(q)                                                     \
    (q)->prev


#ಆದರೆ (NGX_DEBUG)

#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_remove(x)                                                   \
    (x)->ಮುಂದಿನ->prev = (x)->prev;                                              \
    (x)->prev->ಮುಂದಿನ = (x)->ಮುಂದಿನ;                                              \
    (x)->prev = ಖಾಲಿ;                                                         \
    (x)->ಮುಂದಿನ = ಖಾಲಿ

#ಇಲ್ಲದಿದ್ದರೆ

#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_remove(x)                                                   \
    (x)->ಮುಂದಿನ->prev = (x)->prev;                                              \
    (x)->prev->ಮುಂದಿನ = (x)->ಮುಂದಿನ

#ಆದರೆ_ಅಂತ್ಯ


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ವಿಭಜಿಸು(h, q, n)                                              \
    (n)->prev = (h)->prev;                                                    \
    (n)->prev->ಮುಂದಿನ = n;                                                      \
    (n)->ಮುಂದಿನ = q;                                                            \
    (h)->prev = (q)->prev;                                                    \
    (h)->prev->ಮುಂದಿನ = h;                                                      \
    (q)->prev = n;


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ಕೂಡಿಸು(h, n)                                                   \
    (h)->prev->ಮುಂದಿನ = (n)->ಮುಂದಿನ;                                              \
    (n)->ಮುಂದಿನ->prev = (h)->prev;                                              \
    (h)->prev = (n)->prev;                                                    \
    (h)->prev->ಮುಂದಿನ = h;


#ವ್ಯಾಖ್ಯಾನಿಸು ngx_ಸರತಿ_ದತ್ತಾಂಶ(q, type, link)                                         \
    (type *) ((u_char *) q - offsetof(type, link))


ngx_ಸರತಿ_t *ngx_ಸರತಿ_ಮಧ್ಯ(ngx_ಸರತಿ_t *ಸರತಿ);
ಶೂನ್ಯ ngx_ಸರತಿ_ವಿಂಗಡಿಸು(ngx_ಸರತಿ_t *ಸರತಿ,
    ngx_int_t (*cmp)(ಸ್ಥಿರಾಂಕ ngx_ಸರತಿ_t *, ಸ್ಥಿರಾಂಕ ngx_ಸರತಿ_t *));


#ಆದರೆ_ಅಂತ್ಯ /* _NGX_QUEUE_H_INCLUDED_ */
