
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#అన్తర్భావ <ngx_config.h>
#అన్తర్భావ <ngx_core.h>


#నిర్వచితం_కాకపోతే NGX_వరుస_H_INCLUDED
#నిర్వచించు NGX_వరుస_H_INCLUDED


రకనిర్వచనం నిర్మాణం ngx_వరుస_s  ngx_వరుస_t;

నిర్మాణం ngx_వరుస_s {
    ngx_వరుస_t  *prev;
    ngx_వరుస_t  *తదుపరి;
};


#నిర్వచించు ngx_వరుస_init(q)                                                     \
    (q)->prev = q;                                                            \
    (q)->తదుపరి = q


#నిర్వచించు ngx_వరుస_ఖాళీలు(h)                                                    \
    (h == (h)->prev)


#నిర్వచించు ngx_వరుస_చొప్పించు_తల(h, x)                                           \
    (x)->తదుపరి = (h)->తదుపరి;                                                    \
    (x)->తదుపరి->prev = x;                                                      \
    (x)->prev = h;                                                            \
    (h)->తదుపరి = x


#నిర్వచించు ngx_వరుస_చొప్పించు_after   ngx_వరుస_చొప్పించు_తల


#నిర్వచించు ngx_వరుస_చొప్పించు_తోక(h, x)                                           \
    (x)->prev = (h)->prev;                                                    \
    (x)->prev->తదుపరి = x;                                                      \
    (x)->తదుపరి = h;                                                            \
    (h)->prev = x


#నిర్వచించు ngx_వరుస_చొప్పించు_before   ngx_వరుస_చొప్పించు_తోక


#నిర్వచించు ngx_వరుస_తల(h)                                                     \
    (h)->తదుపరి


#నిర్వచించు ngx_వరుస_చివరి(h)                                                     \
    (h)->prev


#నిర్వచించు ngx_వరుస_sentinel(h)                                                 \
    (h)


#నిర్వచించు ngx_వరుస_తదుపరి(q)                                                     \
    (q)->తదుపరి


#నిర్వచించు ngx_వరుస_prev(q)                                                     \
    (q)->prev


#ఒకవేళ (NGX_DEBUG)

#నిర్వచించు ngx_వరుస_remove(x)                                                   \
    (x)->తదుపరి->prev = (x)->prev;                                              \
    (x)->prev->తదుపరి = (x)->తదుపరి;                                              \
    (x)->prev = ఖాళీ;                                                         \
    (x)->తదుపరి = ఖాళీ

#లేకపోతే

#నిర్వచించు ngx_వరుస_remove(x)                                                   \
    (x)->తదుపరి->prev = (x)->prev;                                              \
    (x)->prev->తదుపరి = (x)->తదుపరి

#అయితే_ముగింపు


#నిర్వచించు ngx_వరుస_విభజించు(h, q, n)                                              \
    (n)->prev = (h)->prev;                                                    \
    (n)->prev->తదుపరి = n;                                                      \
    (n)->తదుపరి = q;                                                            \
    (h)->prev = (q)->prev;                                                    \
    (h)->prev->తదుపరి = h;                                                      \
    (q)->prev = n;


#నిర్వచించు ngx_వరుస_కూడు(h, n)                                                   \
    (h)->prev->తదుపరి = (n)->తదుపరి;                                              \
    (n)->తదుపరి->prev = (h)->prev;                                              \
    (h)->prev = (n)->prev;                                                    \
    (h)->prev->తదుపరి = h;


#నిర్వచించు ngx_వరుస_దత్తాంశం(q, type, link)                                         \
    (type *) ((u_char *) q - offsetof(type, link))


ngx_వరుస_t *ngx_వరుస_మధ్య(ngx_వరుస_t *వరుస);
శూన్య ngx_వరుస_క్రమీకరించు(ngx_వరుస_t *వరుస,
    ngx_int_t (*cmp)(స్థిరరాశి ngx_వరుస_t *, స్థిరరాశి ngx_వరుస_t *));


#అయితే_ముగింపు /* _NGX_QUEUE_H_INCLUDED_ */
