
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#ಅನ್ತರ್ಭಾವ <ngx_config.h>
#ಅನ್ತರ್ಭಾವ <ngx_core.h>


ಸ್ಥಿರ ngx_radix_ಗಂಟು_t *ngx_radix_alloc(ngx_radix_ವೃಕ್ಷ_t *ವೃಕ್ಷ);


ngx_radix_ವೃಕ್ಷ_t *
ngx_radix_ವೃಕ್ಷ_create(ngx_pool_t *pool, ngx_int_t preallocate)
{
    uint32_t           ಕೀಲಿ, ಮುಖವಾಡ, inc;
    ngx_radix_ವೃಕ್ಷ_t  *ವೃಕ್ಷ;

    ವೃಕ್ಷ = ngx_palloc(pool, ಗಾತ್ರ(ngx_radix_ವೃಕ್ಷ_t));
    ಆದರೆ (ವೃಕ್ಷ == ಖಾಲಿ) {
        ಹಿಂತಿರುಗಿ ಖಾಲಿ;
    }

    ವೃಕ್ಷ->pool = pool;
    ವೃಕ್ಷ->ಬಿಡುಗಡೆ = ಖಾಲಿ;
    ವೃಕ್ಷ->ಆರಂಭ = ಖಾಲಿ;
    ವೃಕ್ಷ->ಗಾತ್ರ_2 = 0;

    ವೃಕ್ಷ->ಬೇರು = ngx_radix_alloc(ವೃಕ್ಷ);
    ಆದರೆ (ವೃಕ್ಷ->ಬೇರು == ಖಾಲಿ) {
        ಹಿಂತಿರುಗಿ ಖಾಲಿ;
    }

    ವೃಕ್ಷ->ಬೇರು->ಬಲ = ಖಾಲಿ;
    ವೃಕ್ಷ->ಬೇರು->ಎಡ = ಖಾಲಿ;
    ವೃಕ್ಷ->ಬೇರು->ಪೋಷಕ = ಖಾಲಿ;
    ವೃಕ್ಷ->ಬೇರು->ಮೌಲ್ಯ = NGX_RADIX_NO_ಮೌಲ್ಯ;

    ಆದರೆ (preallocate == 0) {
        ಹಿಂತಿರುಗಿ ವೃಕ್ಷ;
    }

    /*
     * Preallocation of first nodes : 0, 1, 00, 01, 10, 11, 000, 001, etc.
     * increases TLB hits even if for first lookup iterations.
     * On 32-bit platforms the 7 preallocated bits takes continuous 4K,
     * 8 - 8K, 9 - 16K, etc.  On 64-bit platforms the 6 preallocated bits
     * takes continuous 4K, 7 - 8K, 8 - 16K, etc.  There is no sense to
     * to preallocate more than one page, because further preallocation
     * distributes the only bit per page.  Instead, a random insertion
     * may distribute several bits per page.
     *
     * Thus, by default we preallocate maximum
     *     6 bits on amd64 (64-bit platform and 4K pages)
     *     7 bits on i386 (32-bit platform and 4K pages)
     *     7 bits on sparc64 in 64-bit mode (8K pages)
     *     8 bits on sparc64 in 32-bit mode (8K pages)
     */

    ಆದರೆ (preallocate == -1) {
        ಆಯ್ಕೆ (ngx_pagesize / ಗಾತ್ರ(ngx_radix_ಗಂಟು_t)) {

        /* amd64 */
        ಸ್ಥಿತಿ 128:
            preallocate = 6;
            ನಿಲ್ಲಿಸು;

        /* i386, sparc64 */
        ಸ್ಥಿತಿ 256:
            preallocate = 7;
            ನಿಲ್ಲಿಸು;

        /* sparc64 in 32-bit mode */
        ಪೂರ್ವನಿಯೋಜಿತ:
            preallocate = 8;
        }
    }

    ಮುಖವಾಡ = 0;
    inc = 0x80000000;

    ಆಗ (preallocate--) {

        ಕೀಲಿ = 0;
        ಮುಖವಾಡ >>= 1;
        ಮುಖವಾಡ |= 0x80000000;

        ಮಾಡು {
            ಆದರೆ (ngx_radix32tree_ಸೇರಿಸು(ವೃಕ್ಷ, ಕೀಲಿ, ಮುಖವಾಡ, NGX_RADIX_NO_ಮೌಲ್ಯ)
                != NGX_OK)
            {
                ಹಿಂತಿರುಗಿ ಖಾಲಿ;
            }

            ಕೀಲಿ += inc;

        } ಆಗ (ಕೀಲಿ);

        inc >>= 1;
    }

    ಹಿಂತಿರುಗಿ ವೃಕ್ಷ;
}


ngx_int_t
ngx_radix32tree_ಸೇರಿಸು(ngx_radix_ವೃಕ್ಷ_t *ವೃಕ್ಷ, uint32_t ಕೀಲಿ, uint32_t ಮುಖವಾಡ,
    uintptr_t ಮೌಲ್ಯ)
{
    uint32_t           ಬಿಟ್;
    ngx_radix_ಗಂಟು_t  *ಗಂಟು, *ಮುಂದಿನ;

    ಬಿಟ್ = 0x80000000;

    ಗಂಟು = ವೃಕ್ಷ->ಬೇರು;
    ಮುಂದಿನ = ವೃಕ್ಷ->ಬೇರು;

    ಆಗ (ಬಿಟ್ & ಮುಖವಾಡ) {
        ಆದರೆ (ಕೀಲಿ & ಬಿಟ್) {
            ಮುಂದಿನ = ಗಂಟು->ಬಲ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಮುಂದಿನ = ಗಂಟು->ಎಡ;
        }

        ಆದರೆ (ಮುಂದಿನ == ಖಾಲಿ) {
            ನಿಲ್ಲಿಸು;
        }

        ಬಿಟ್ >>= 1;
        ಗಂಟು = ಮುಂದಿನ;
    }

    ಆದರೆ (ಮುಂದಿನ) {
        ಆದರೆ (ಗಂಟು->ಮೌಲ್ಯ != NGX_RADIX_NO_ಮೌಲ್ಯ) {
            ಹಿಂತಿರುಗಿ NGX_BUSY;
        }

        ಗಂಟು->ಮೌಲ್ಯ = ಮೌಲ್ಯ;
        ಹಿಂತಿರುಗಿ NGX_OK;
    }

    ಆಗ (ಬಿಟ್ & ಮುಖವಾಡ) {
        ಮುಂದಿನ = ngx_radix_alloc(ವೃಕ್ಷ);
        ಆದರೆ (ಮುಂದಿನ == ಖಾಲಿ) {
            ಹಿಂತಿರುಗಿ NGX_ERROR;
        }

        ಮುಂದಿನ->ಬಲ = ಖಾಲಿ;
        ಮುಂದಿನ->ಎಡ = ಖಾಲಿ;
        ಮುಂದಿನ->ಪೋಷಕ = ಗಂಟು;
        ಮುಂದಿನ->ಮೌಲ್ಯ = NGX_RADIX_NO_ಮೌಲ್ಯ;

        ಆದರೆ (ಕೀಲಿ & ಬಿಟ್) {
            ಗಂಟು->ಬಲ = ಮುಂದಿನ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಂಟು->ಎಡ = ಮುಂದಿನ;
        }

        ಬಿಟ್ >>= 1;
        ಗಂಟು = ಮುಂದಿನ;
    }

    ಗಂಟು->ಮೌಲ್ಯ = ಮೌಲ್ಯ;

    ಹಿಂತಿರುಗಿ NGX_OK;
}


ngx_int_t
ngx_radix32tree_delete(ngx_radix_ವೃಕ್ಷ_t *ವೃಕ್ಷ, uint32_t ಕೀಲಿ, uint32_t ಮುಖವಾಡ)
{
    uint32_t           ಬಿಟ್;
    ngx_radix_ಗಂಟು_t  *ಗಂಟು;

    ಬಿಟ್ = 0x80000000;
    ಗಂಟು = ವೃಕ್ಷ->ಬೇರು;

    ಆಗ (ಗಂಟು && (ಬಿಟ್ & ಮುಖವಾಡ)) {
        ಆದರೆ (ಕೀಲಿ & ಬಿಟ್) {
            ಗಂಟು = ಗಂಟು->ಬಲ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಂಟು = ಗಂಟು->ಎಡ;
        }

        ಬಿಟ್ >>= 1;
    }

    ಆದರೆ (ಗಂಟು == ಖಾಲಿ) {
        ಹಿಂತಿರುಗಿ NGX_ERROR;
    }

    ಆದರೆ (ಗಂಟು->ಬಲ || ಗಂಟು->ಎಡ) {
        ಆದರೆ (ಗಂಟು->ಮೌಲ್ಯ != NGX_RADIX_NO_ಮೌಲ್ಯ) {
            ಗಂಟು->ಮೌಲ್ಯ = NGX_RADIX_NO_ಮೌಲ್ಯ;
            ಹಿಂತಿರುಗಿ NGX_OK;
        }

        ಹಿಂತಿರುಗಿ NGX_ERROR;
    }

    ಗಾಗಿ ( ;; ) {
        ಆದರೆ (ಗಂಟು->ಪೋಷಕ->ಬಲ == ಗಂಟು) {
            ಗಂಟು->ಪೋಷಕ->ಬಲ = ಖಾಲಿ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಂಟು->ಪೋಷಕ->ಎಡ = ಖಾಲಿ;
        }

        ಗಂಟು->ಬಲ = ವೃಕ್ಷ->ಬಿಡುಗಡೆ;
        ವೃಕ್ಷ->ಬಿಡುಗಡೆ = ಗಂಟು;

        ಗಂಟು = ಗಂಟು->ಪೋಷಕ;

        ಆದರೆ (ಗಂಟು->ಬಲ || ಗಂಟು->ಎಡ) {
            ನಿಲ್ಲಿಸು;
        }

        ಆದರೆ (ಗಂಟು->ಮೌಲ್ಯ != NGX_RADIX_NO_ಮೌಲ್ಯ) {
            ನಿಲ್ಲಿಸು;
        }

        ಆದರೆ (ಗಂಟು->ಪೋಷಕ == ಖಾಲಿ) {
            ನಿಲ್ಲಿಸು;
        }
    }

    ಹಿಂತಿರುಗಿ NGX_OK;
}


uintptr_t
ngx_radix32tree_ಕಂಡುಹಿಡಿ(ngx_radix_ವೃಕ್ಷ_t *ವೃಕ್ಷ, uint32_t ಕೀಲಿ)
{
    uint32_t           ಬಿಟ್;
    uintptr_t          ಮೌಲ್ಯ;
    ngx_radix_ಗಂಟು_t  *ಗಂಟು;

    ಬಿಟ್ = 0x80000000;
    ಮೌಲ್ಯ = NGX_RADIX_NO_ಮೌಲ್ಯ;
    ಗಂಟು = ವೃಕ್ಷ->ಬೇರು;

    ಆಗ (ಗಂಟು) {
        ಆದರೆ (ಗಂಟು->ಮೌಲ್ಯ != NGX_RADIX_NO_ಮೌಲ್ಯ) {
            ಮೌಲ್ಯ = ಗಂಟು->ಮೌಲ್ಯ;
        }

        ಆದರೆ (ಕೀಲಿ & ಬಿಟ್) {
            ಗಂಟು = ಗಂಟು->ಬಲ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಂಟು = ಗಂಟು->ಎಡ;
        }

        ಬಿಟ್ >>= 1;
    }

    ಹಿಂತಿರುಗಿ ಮೌಲ್ಯ;
}


#ಆದರೆ (NGX_HAVE_INET6)

ngx_int_t
ngx_radix128tree_ಸೇರಿಸು(ngx_radix_ವೃಕ್ಷ_t *ವೃಕ್ಷ, u_char *ಕೀಲಿ, u_char *ಮುಖವಾಡ,
    uintptr_t ಮೌಲ್ಯ)
{
    u_char             ಬಿಟ್;
    ngx_uint_t         i;
    ngx_radix_ಗಂಟು_t  *ಗಂಟು, *ಮುಂದಿನ;

    i = 0;
    ಬಿಟ್ = 0x80;

    ಗಂಟು = ವೃಕ್ಷ->ಬೇರು;
    ಮುಂದಿನ = ವೃಕ್ಷ->ಬೇರು;

    ಆಗ (ಬಿಟ್ & ಮುಖವಾಡ[i]) {
        ಆದರೆ (ಕೀಲಿ[i] & ಬಿಟ್) {
            ಮುಂದಿನ = ಗಂಟು->ಬಲ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಮುಂದಿನ = ಗಂಟು->ಎಡ;
        }

        ಆದರೆ (ಮುಂದಿನ == ಖಾಲಿ) {
            ನಿಲ್ಲಿಸು;
        }

        ಬಿಟ್ >>= 1;
        ಗಂಟು = ಮುಂದಿನ;

        ಆದರೆ (ಬಿಟ್ == 0) {
            ಆದರೆ (++i == 16) {
                ನಿಲ್ಲಿಸು;
            }

            ಬಿಟ್ = 0x80;
        }
    }

    ಆದರೆ (ಮುಂದಿನ) {
        ಆದರೆ (ಗಂಟು->ಮೌಲ್ಯ != NGX_RADIX_NO_ಮೌಲ್ಯ) {
            ಹಿಂತಿರುಗಿ NGX_BUSY;
        }

        ಗಂಟು->ಮೌಲ್ಯ = ಮೌಲ್ಯ;
        ಹಿಂತಿರುಗಿ NGX_OK;
    }

    ಆಗ (ಬಿಟ್ & ಮುಖವಾಡ[i]) {
        ಮುಂದಿನ = ngx_radix_alloc(ವೃಕ್ಷ);
        ಆದರೆ (ಮುಂದಿನ == ಖಾಲಿ) {
            ಹಿಂತಿರುಗಿ NGX_ERROR;
        }

        ಮುಂದಿನ->ಬಲ = ಖಾಲಿ;
        ಮುಂದಿನ->ಎಡ = ಖಾಲಿ;
        ಮುಂದಿನ->ಪೋಷಕ = ಗಂಟು;
        ಮುಂದಿನ->ಮೌಲ್ಯ = NGX_RADIX_NO_ಮೌಲ್ಯ;

        ಆದರೆ (ಕೀಲಿ[i] & ಬಿಟ್) {
            ಗಂಟು->ಬಲ = ಮುಂದಿನ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಂಟು->ಎಡ = ಮುಂದಿನ;
        }

        ಬಿಟ್ >>= 1;
        ಗಂಟು = ಮುಂದಿನ;

        ಆದರೆ (ಬಿಟ್ == 0) {
            ಆದರೆ (++i == 16) {
                ನಿಲ್ಲಿಸು;
            }

            ಬಿಟ್ = 0x80;
        }
    }

    ಗಂಟು->ಮೌಲ್ಯ = ಮೌಲ್ಯ;

    ಹಿಂತಿರುಗಿ NGX_OK;
}


ngx_int_t
ngx_radix128tree_delete(ngx_radix_ವೃಕ್ಷ_t *ವೃಕ್ಷ, u_char *ಕೀಲಿ, u_char *ಮುಖವಾಡ)
{
    u_char             ಬಿಟ್;
    ngx_uint_t         i;
    ngx_radix_ಗಂಟು_t  *ಗಂಟು;

    i = 0;
    ಬಿಟ್ = 0x80;
    ಗಂಟು = ವೃಕ್ಷ->ಬೇರು;

    ಆಗ (ಗಂಟು && (ಬಿಟ್ & ಮುಖವಾಡ[i])) {
        ಆದರೆ (ಕೀಲಿ[i] & ಬಿಟ್) {
            ಗಂಟು = ಗಂಟು->ಬಲ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಂಟು = ಗಂಟು->ಎಡ;
        }

        ಬಿಟ್ >>= 1;

        ಆದರೆ (ಬಿಟ್ == 0) {
            ಆದರೆ (++i == 16) {
                ನಿಲ್ಲಿಸು;
            }

            ಬಿಟ್ = 0x80;
        }
    }

    ಆದರೆ (ಗಂಟು == ಖಾಲಿ) {
        ಹಿಂತಿರುಗಿ NGX_ERROR;
    }

    ಆದರೆ (ಗಂಟು->ಬಲ || ಗಂಟು->ಎಡ) {
        ಆದರೆ (ಗಂಟು->ಮೌಲ್ಯ != NGX_RADIX_NO_ಮೌಲ್ಯ) {
            ಗಂಟು->ಮೌಲ್ಯ = NGX_RADIX_NO_ಮೌಲ್ಯ;
            ಹಿಂತಿರುಗಿ NGX_OK;
        }

        ಹಿಂತಿರುಗಿ NGX_ERROR;
    }

    ಗಾಗಿ ( ;; ) {
        ಆದರೆ (ಗಂಟು->ಪೋಷಕ->ಬಲ == ಗಂಟು) {
            ಗಂಟು->ಪೋಷಕ->ಬಲ = ಖಾಲಿ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಂಟು->ಪೋಷಕ->ಎಡ = ಖಾಲಿ;
        }

        ಗಂಟು->ಬಲ = ವೃಕ್ಷ->ಬಿಡುಗಡೆ;
        ವೃಕ್ಷ->ಬಿಡುಗಡೆ = ಗಂಟು;

        ಗಂಟು = ಗಂಟು->ಪೋಷಕ;

        ಆದರೆ (ಗಂಟು->ಬಲ || ಗಂಟು->ಎಡ) {
            ನಿಲ್ಲಿಸು;
        }

        ಆದರೆ (ಗಂಟು->ಮೌಲ್ಯ != NGX_RADIX_NO_ಮೌಲ್ಯ) {
            ನಿಲ್ಲಿಸು;
        }

        ಆದರೆ (ಗಂಟು->ಪೋಷಕ == ಖಾಲಿ) {
            ನಿಲ್ಲಿಸು;
        }
    }

    ಹಿಂತಿರುಗಿ NGX_OK;
}


uintptr_t
ngx_radix128tree_ಕಂಡುಹಿಡಿ(ngx_radix_ವೃಕ್ಷ_t *ವೃಕ್ಷ, u_char *ಕೀಲಿ)
{
    u_char             ಬಿಟ್;
    uintptr_t          ಮೌಲ್ಯ;
    ngx_uint_t         i;
    ngx_radix_ಗಂಟು_t  *ಗಂಟು;

    i = 0;
    ಬಿಟ್ = 0x80;
    ಮೌಲ್ಯ = NGX_RADIX_NO_ಮೌಲ್ಯ;
    ಗಂಟು = ವೃಕ್ಷ->ಬೇರು;

    ಆಗ (ಗಂಟು) {
        ಆದರೆ (ಗಂಟು->ಮೌಲ್ಯ != NGX_RADIX_NO_ಮೌಲ್ಯ) {
            ಮೌಲ್ಯ = ಗಂಟು->ಮೌಲ್ಯ;
        }

        ಆದರೆ (ಕೀಲಿ[i] & ಬಿಟ್) {
            ಗಂಟು = ಗಂಟು->ಬಲ;

        } ಇಲ್ಲದಿದ್ದರೆ {
            ಗಂಟು = ಗಂಟು->ಎಡ;
        }

        ಬಿಟ್ >>= 1;

        ಆದರೆ (ಬಿಟ್ == 0) {
            i++;
            ಬಿಟ್ = 0x80;
        }
    }

    ಹಿಂತಿರುಗಿ ಮೌಲ್ಯ;
}

#ಆದರೆ_ಅಂತ್ಯ


ಸ್ಥಿರ ngx_radix_ಗಂಟು_t *
ngx_radix_alloc(ngx_radix_ವೃಕ್ಷ_t *ವೃಕ್ಷ)
{
    ngx_radix_ಗಂಟು_t  *p;

    ಆದರೆ (ವೃಕ್ಷ->ಬಿಡುಗಡೆ) {
        p = ವೃಕ್ಷ->ಬಿಡುಗಡೆ;
        ವೃಕ್ಷ->ಬಿಡುಗಡೆ = ವೃಕ್ಷ->ಬಿಡುಗಡೆ->ಬಲ;
        ಹಿಂತಿರುಗಿ p;
    }

    ಆದರೆ (ವೃಕ್ಷ->ಗಾತ್ರ_2 < ಗಾತ್ರ(ngx_radix_ಗಂಟು_t)) {
        ವೃಕ್ಷ->ಆರಂಭ = ngx_pmemalign(ವೃಕ್ಷ->pool, ngx_pagesize, ngx_pagesize);
        ಆದರೆ (ವೃಕ್ಷ->ಆರಂಭ == ಖಾಲಿ) {
            ಹಿಂತಿರುಗಿ ಖಾಲಿ;
        }

        ವೃಕ್ಷ->ಗಾತ್ರ_2 = ngx_pagesize;
    }

    p = (ngx_radix_ಗಂಟು_t *) ವೃಕ್ಷ->ಆರಂಭ;
    ವೃಕ್ಷ->ಆರಂಭ += ಗಾತ್ರ(ngx_radix_ಗಂಟು_t);
    ವೃಕ್ಷ->ಗಾತ್ರ_2 -= ಗಾತ್ರ(ngx_radix_ಗಂಟು_t);

    ಹಿಂತಿರುಗಿ p;
}
