
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#شامل <ngx_config.h>
#شامل <ngx_core.h>


#اگر_غیر_تعریف_شدہ NGX_قطار_H_INCLUDED
#تعریف_کرو NGX_قطار_H_INCLUDED


قسمتعریف ساخت ngx_قطار_s  ngx_قطار_t;

ساخت ngx_قطار_s {
    ngx_قطار_t  *پچھلا;
    ngx_قطار_t  *اگلا;
};


#تعریف_کرو ngx_قطار_init(q)                                                     \
    (q)->پچھلا = q;                                                            \
    (q)->اگلا = q


#تعریف_کرو ngx_قطار_خالی_خانے(h)                                                    \
    (h == (h)->پچھلا)


#تعریف_کرو ngx_قطار_داخل_کرو_سر(h, x)                                           \
    (x)->اگلا = (h)->اگلا;                                                    \
    (x)->اگلا->پچھلا = x;                                                      \
    (x)->پچھلا = h;                                                            \
    (h)->اگلا = x


#تعریف_کرو ngx_قطار_داخل_کرو_after   ngx_قطار_داخل_کرو_سر


#تعریف_کرو ngx_قطار_داخل_کرو_دم(h, x)                                           \
    (x)->پچھلا = (h)->پچھلا;                                                    \
    (x)->پچھلا->اگلا = x;                                                      \
    (x)->اگلا = h;                                                            \
    (h)->پچھلا = x


#تعریف_کرو ngx_قطار_داخل_کرو_before   ngx_قطار_داخل_کرو_دم


#تعریف_کرو ngx_قطار_سر(h)                                                     \
    (h)->اگلا


#تعریف_کرو ngx_قطار_آخری(h)                                                     \
    (h)->پچھلا


#تعریف_کرو ngx_قطار_sentinel(h)                                                 \
    (h)


#تعریف_کرو ngx_قطار_اگلا(q)                                                     \
    (q)->اگلا


#تعریف_کرو ngx_قطار_پچھلا(q)                                                     \
    (q)->پچھلا


#اگر (NGX_DEBUG)

#تعریف_کرو ngx_قطار_remove(x)                                                   \
    (x)->اگلا->پچھلا = (x)->پچھلا;                                              \
    (x)->پچھلا->اگلا = (x)->اگلا;                                              \
    (x)->پچھلا = تہی;                                                         \
    (x)->اگلا = تہی

#ورنہ

#تعریف_کرو ngx_قطار_remove(x)                                                   \
    (x)->اگلا->پچھلا = (x)->پچھلا;                                              \
    (x)->پچھلا->اگلا = (x)->اگلا

#اگر_ختم


#تعریف_کرو ngx_قطار_بانٹو(h, q, n)                                              \
    (n)->پچھلا = (h)->پچھلا;                                                    \
    (n)->پچھلا->اگلا = n;                                                      \
    (n)->اگلا = q;                                                            \
    (h)->پچھلا = (q)->پچھلا;                                                    \
    (h)->پچھلا->اگلا = h;                                                      \
    (q)->پچھلا = n;


#تعریف_کرو ngx_قطار_جوڑو(h, n)                                                   \
    (h)->پچھلا->اگلا = (n)->اگلا;                                              \
    (n)->اگلا->پچھلا = (h)->پچھلا;                                              \
    (h)->پچھلا = (n)->پچھلا;                                                    \
    (h)->پچھلا->اگلا = h;


#تعریف_کرو ngx_قطار_ڈیٹا(q, type, link)                                         \
    (type *) ((u_char *) q - offsetof(type, link))


ngx_قطار_t *ngx_قطار_درمیان(ngx_قطار_t *قطار);
خالی ngx_قطار_ترتیب_دو(ngx_قطار_t *قطار,
    ngx_int_t (*cmp)(ثابت ngx_قطار_t *, ثابت ngx_قطار_t *));


#اگر_ختم /* _NGX_QUEUE_H_INCLUDED_ */
