
/*
 * Copyright (C) Igor Sysoev
 * Copyright (C) Nginx, Inc.
 */


#ಅನ್ತರ್ಭಾವ <ngx_config.h>
#ಅನ್ತರ್ಭಾವ <ngx_core.h>


ಸ್ಥಿರ ಶೂನ್ಯ ngx_ಸರತಿ_ವಿಲೀನ(ngx_ಸರತಿ_t *ಸರತಿ, ngx_ಸರತಿ_t *ಬಾಲ,
    ngx_int_t (*cmp)(ಸ್ಥಿರಾಂಕ ngx_ಸರತಿ_t *, ಸ್ಥಿರಾಂಕ ngx_ಸರತಿ_t *));


/*
 * find the middle queue element if the queue has odd number of elements
 * or the first element of the queue's second part otherwise
 */

ngx_ಸರತಿ_t *
ngx_ಸರತಿ_ಮಧ್ಯ(ngx_ಸರತಿ_t *ಸರತಿ)
{
    ngx_ಸರತಿ_t  *ಮಧ್ಯ, *ಮುಂದಿನ;

    ಮಧ್ಯ = ngx_ಸರತಿ_ತಲೆ(ಸರತಿ);

    ಆದರೆ (ಮಧ್ಯ == ngx_ಸರತಿ_ಕೊನೆಯ(ಸರತಿ)) {
        ಹಿಂತಿರುಗಿ ಮಧ್ಯ;
    }

    ಮುಂದಿನ = ngx_ಸರತಿ_ತಲೆ(ಸರತಿ);

    ಗಾಗಿ ( ;; ) {
        ಮಧ್ಯ = ngx_ಸರತಿ_ಮುಂದಿನ(ಮಧ್ಯ);

        ಮುಂದಿನ = ngx_ಸರತಿ_ಮುಂದಿನ(ಮುಂದಿನ);

        ಆದರೆ (ಮುಂದಿನ == ngx_ಸರತಿ_ಕೊನೆಯ(ಸರತಿ)) {
            ಹಿಂತಿರುಗಿ ಮಧ್ಯ;
        }

        ಮುಂದಿನ = ngx_ಸರತಿ_ಮುಂದಿನ(ಮುಂದಿನ);

        ಆದರೆ (ಮುಂದಿನ == ngx_ಸರತಿ_ಕೊನೆಯ(ಸರತಿ)) {
            ಹಿಂತಿರುಗಿ ಮಧ್ಯ;
        }
    }
}


/* the stable merge sort */

ಶೂನ್ಯ
ngx_ಸರತಿ_ವಿಂಗಡಿಸು(ngx_ಸರತಿ_t *ಸರತಿ,
    ngx_int_t (*cmp)(ಸ್ಥಿರಾಂಕ ngx_ಸರತಿ_t *, ಸ್ಥಿರಾಂಕ ngx_ಸರತಿ_t *))
{
    ngx_ಸರತಿ_t  *q, ಬಾಲ;

    q = ngx_ಸರತಿ_ತಲೆ(ಸರತಿ);

    ಆದರೆ (q == ngx_ಸರತಿ_ಕೊನೆಯ(ಸರತಿ)) {
        ಹಿಂತಿರುಗಿ;
    }

    q = ngx_ಸರತಿ_ಮಧ್ಯ(ಸರತಿ);

    ngx_ಸರತಿ_ವಿಭಜಿಸು(ಸರತಿ, q, &ಬಾಲ);

    ngx_ಸರತಿ_ವಿಂಗಡಿಸು(ಸರತಿ, cmp);
    ngx_ಸರತಿ_ವಿಂಗಡಿಸು(&ಬಾಲ, cmp);

    ngx_ಸರತಿ_ವಿಲೀನ(ಸರತಿ, &ಬಾಲ, cmp);
}


ಸ್ಥಿರ ಶೂನ್ಯ
ngx_ಸರತಿ_ವಿಲೀನ(ngx_ಸರತಿ_t *ಸರತಿ, ngx_ಸರತಿ_t *ಬಾಲ,
    ngx_int_t (*cmp)(ಸ್ಥಿರಾಂಕ ngx_ಸರತಿ_t *, ಸ್ಥಿರಾಂಕ ngx_ಸರತಿ_t *))
{
    ngx_ಸರತಿ_t  *q1, *q2;

    q1 = ngx_ಸರತಿ_ತಲೆ(ಸರತಿ);
    q2 = ngx_ಸರತಿ_ತಲೆ(ಬಾಲ);

    ಗಾಗಿ ( ;; ) {
        ಆದರೆ (q1 == ngx_ಸರತಿ_sentinel(ಸರತಿ)) {
            ngx_ಸರತಿ_ಕೂಡಿಸು(ಸರತಿ, ಬಾಲ);
            ನಿಲ್ಲಿಸು;
        }

        ಆದರೆ (q2 == ngx_ಸರತಿ_sentinel(ಬಾಲ)) {
            ನಿಲ್ಲಿಸು;
        }

        ಆದರೆ (cmp(q1, q2) <= 0) {
            q1 = ngx_ಸರತಿ_ಮುಂದಿನ(q1);
            ಮುಂದುವರಿ;
        }

        ngx_ಸರತಿ_remove(q2);
        ngx_ಸರತಿ_ಸೇರಿಸು_before(q1, q2);

        q2 = ngx_ಸರತಿ_ತಲೆ(ಬಾಲ);
    }
}
